{
    "version": "https://jsonfeed.org/version/1",
    "title": "bainz library",
    "description": "",
    "home_page_url": "https://bainz.ca",
    "feed_url": "https://bainz.ca/feed.json",
    "user_comment": "",
    "author": {
        "name": "bainz"
    },
    "items": [
        {
            "id": "https://bainz.ca/persona-3-reload-party-member-builds/",
            "url": "https://bainz.ca/persona-3-reload-party-member-builds/",
            "title": "Persona 3 Reload Party Member Builds",
            "summary": "As I’ve done for P5 and P4, I wanted to make a&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">As I’ve done for P5 and P4, I wanted to make a post about the different party members in the recent P3 remake: Persona 3 Reload. This post contains the builds I had on each teammate at the end of my first playthrough. These builds can of course be changed however you want, if there are some skills I got rid of, that you’d rather keep.</p>\n<p class=\"graf graf--p\">In the following video, I went over each character, what they do and my thoughts on them as party members (check out the rest of my YouTube too btw). While it does contain a tier list format, it was very much intended as just a way to discuss each character, rather than their specific placements.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/LxfFwMA7J3Q\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">In the above video, I probably did overrate/underrate some of the party members. I rated Yukari pretty highly simply because I found her to be the most convenient/comfortable Healer to use, but Ken has a lot of things going for him, so they can be fairly interchangeable. If I was making this list again, I’d probably move Koromaru up a tier, his combination of coverage moves, AoE Charge, Revolution, and (eventually) Masukukaja/Debilitate are way too good. The dog is OP.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/egLpQcgmqZU\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">In the above video, I made an updated ranking, taking into account the Episode Aigis DLC, as well as more time playing the game! Check it out.</p>\n<p class=\"graf graf--p\">Related:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" data-href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" data-href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Party Member Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" data-href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 4 Golden Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" data-href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 4 Golden Party Member Builds</a></li>\n</ul>\n<hr></div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Yukari</h4>\n<figure class=\"graf graf--figure\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*mWpnDuBF8vGX2guBowJIcw.png\" alt=\"Yukari\" data-image-id=\"1*mWpnDuBF8vGX2guBowJIcw.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Yukari is your standard Healer: she heals, removes ailments, lowers enemy agility, and heals even more. The main draw for Yukari are her characteristics, which reduce her SP costs for healing by 50-75%. This lets you have basically infinite healing for Tartarus runs and boss fights. Do you need that much healing? Probably no, but it’s still nice to have sometimes. Yukari’s 2nd Theurgy is a full team Concentrate (2.3x Damage in Reload), allowing her to support the team even more. Magic isn’t as strong as Phys in P3R, but I’m not gonna complain about that type of support skill on a healer.</p>\n<p class=\"graf graf--p\">Diarahan on this build could be swapped out, as Yukari’s characteristic makes full team healing so cheap as it is. But there’s not really any good move to replace it with (I’m never using Wind Break or ailments tbh). So I was fine keeping it here.</p>\n<h4 class=\"graf graf--h4\">Junpei</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*ssev7tDrZVhqGoW-lcnY5g.png\" data-image-id=\"1*ssev7tDrZVhqGoW-lcnY5g.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Junpei is your Critical Hit specialist in P3R, with his Theurgy charging faster after landing a crit and his characteristic increasing his Critical Rate &amp; Damage. Junpei can benefit quite a bit from gear, so getting the Omega Drive accessory (available as a reward for saving the missing person in Tartarus Floor 177) or his Ultimate Weapon (Masakado’s Katana in the Antique Store) would be pretty good for him, providing Apt Pupil (2x Crit Rate). Another great mid-game accessory for Junpei are the Slash Bracers (Slash Boost) from the Antique Store.</p>\n<p class=\"graf graf--p\">I didn’t keep Junpei’s Strike attack on this build (Gigantic Fist), as late game the damage on it isn’t impressive and I have MC/Akihiko/Aigis for Strike.</p>\n<h4 class=\"graf graf--h4\">Akihiko</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*TyL4kTVNM_jxwV_1hmlPNg.png\" data-image-id=\"1*TyL4kTVNM_jxwV_1hmlPNg.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Akihiko can be one of the most misunderstood characters in P3R, simply because the wording on his Theurgy condition is awful. In-game it states, “After strengthening himself, his fighting spirit rises”. This makes it seem like you have to use Aki to buff himself, but how it actually works is: whenever Aki’s turn begins, if he has any type of buff on him, his Theurgy charges faster. Any teamwide buff works for this, making Akihiko have one of the fastest charging Theurgies.</p>\n<p class=\"graf graf--p\">His final characteristic Buff Amp doesn’t specify it’s value either, but it actually gives a 1.3x Boost to any type of buff. This means that when Akihiko has an Attack Buff, instead of the normal 1.4x Damage, he’ll do ~1.82x Damage.</p>\n<p class=\"graf graf--p\">All this means Akihiko will be one of the highest damaging party members you have, and he works with either Phys or Magic. His support options of Atk Down/Agi Up aren’t the best out of the team, so he’s definitely not a must pick character, but he’s very solid.</p>\n<p class=\"graf graf--p\">The Double Ziggurat weapon (Strike Amp) and Strike Bracers accessory (Strike Boost) help his physical damage a lot. Don’t use Evil Gloves (his “Ultimate Weapon”) on Akihiko, if MC has a Persona with Auto-Mataru/Maraku/Masuku, that weapon does literally nothing. I did keep both the Single Target and AoE Electric skills on Akihiko, but one of them could be replaced with Shock Boost.</p>\n<h4 class=\"graf graf--h4\">Mitsuru</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*33DX9tEWoAxdKM0YeowVUA.png\" data-image-id=\"1*33DX9tEWoAxdKM0YeowVUA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*mk7PIxAwjKzR1Mw7wiL4fA.png\" data-image-id=\"1*mk7PIxAwjKzR1Mw7wiL4fA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Episode Aigis</figcaption>\n</figure>\n<p class=\"graf graf--p\">Mitsuru is your main Magic damage dealer throughout the game. Because of how skewed Reload is in favor of Phys, Akihiko/Junpei/Aigis will generally out-damage her, but she has some other things going for her. The support skill of Rakunda/Marakunda lowering enemy defense is super nice to have, being a reliable way to increase your whole team’s damage by 40% in any situation.</p>\n<p class=\"graf graf--p\">Her characteristic increases the Critical Rate of the whole party on enemies inflicted with an ailment. If you use the “Assassin Website Note” (from Club Escapade in September) on the dorm PC, you can acquire the ability to put Distress on enemies automatically when you ambush them. This lets you have a decent crit rate boost in almost every random encounter. Ailments are pretty much never useful for bosses, so that aspect of Mitsuru’s kit definitely takes a hit in those situations.</p>\n<p class=\"graf graf--p\">For Mitsuru to do max damage late game, you’d want to have the Kokuseki Senjin weapon (Magic Ability) and Varna Bracers accessory (Ice Amp) from the Antique Store. On this build, I did remove Neuro Slash as it doesn’t do much damage. I kept Ice Break as many late game enemies block Ice, but it could be replaced with Freeze Boost.</p>\n<p class=\"graf graf--p\">In Episode Aigis, Mitsuru got Vorpal Blade, so she can actually be a Phys DPS with Slash/Crit gear. See my Episode Aigis ranking for more info.</p>\n<h4 class=\"graf graf--h4\">Aigis</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*tvtrYiaA3f0Hwi3_-CLQdQ.png\" data-image-id=\"1*tvtrYiaA3f0Hwi3_-CLQdQ.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Aigis is your go-to buffer and Pierce damage dealer in the game. She also gets Resist Phys, Enduring Soul, Insta-Heal and the highest base Endurance stat for any party member, making her very tanky. Aigis’ best armor has a Null Ailments passive, which is why I didn’t keep Insta-Heal on this build. Aigis is pretty straightforward, using Phys attacks charge her Theurgy, her characteristic increases the damage of said Phys attacks, and you have Atk/Def buffs available to use.</p>\n<h4 class=\"graf graf--h4\">Koromaru</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*X_kD06AysfxTp5JMWg34iw.png\" data-image-id=\"1*X_kD06AysfxTp5JMWg34iw.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Koromaru is simply one of the best party members in the game. As soon as you get him, Koro is able to use 2 Theurgies, with the 2nd one, Power Howling, being a full party Charge. This is, in my opinion, the strongest support move in the game, as Phys is so good in Reload, and it lets any party member do 2.3x more damage with their next Phys attack.</p>\n<p class=\"graf graf--p\">He gets coverage options in Fire, Dark, Slash, Almighty, and you can even get a weapon in the mid-game (Hazakura in the Antique Store) that turns his basic attack to Wind affinity, letting him hit 4 weaknesses. Revolution boosts your whole team’s crit rate. Masukukaja and Debilitate come pretty far in, but they add a lot to Koro’s support skill set.</p>\n<p class=\"graf graf--p\">Last thing to note about Koro is, Getsu-ei is a lot stronger than Tempest Slash when you are close to a Full Moon. And since pretty much every relevant fight happens on a Full Moon day, it’s a lot better to keep. Also, it has higher crit rate (15% vs 8% base chance). In Episode Aigis, Getsu-Ei got removed, so just use Tempest Slash.</p>\n<h4 class=\"graf graf--h4\">Ken</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*pcvYBDS_hbExQv7GRdXe_A.png\" data-image-id=\"1*pcvYBDS_hbExQv7GRdXe_A.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*u4_t4eNJgDoXXhsNyaEizA.png\" data-image-id=\"1*u4_t4eNJgDoXXhsNyaEizA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Episode Aigis</figcaption>\n</figure>\n<p class=\"graf graf--p\">Ken is your second Healer, and he does get a number of different moves in his kit. He gets Electric, Light and Pierce coverage moves, so he’s able to hit more weaknesses than most party members. I didn’t keep Vile Assault on this build, but you can still get Pierce knockdowns with Ken’s basic attack. Most of the time, I’d use MC/Aigis/Junpei for Pierce so I opted to keep more of Ken’s support skills. I didn’t keep Samarecarm either, as revive items are fairly accessible, so the skill slot felt better used on other stuff.</p>\n<p class=\"graf graf--p\">In Episode Aigis, Ken learnt some new Pierce moves, including Myriad Arrows. I found myself not using Heat Riser much (prefer full party buffs), so I kept the 2 Pierce moves this time.</p>\n<p class=\"graf graf--p\">Ken has screens for Tetrakarn and Makarkarn, and his 2nd Theurgy takes this one step further, fully healing and reviving all teammates, as well as providing 1 layer of each screen for everyone. This is a great Theurgy, and if you keep Ken below 50% SP, he can get it back really quickly (every 3 turns). I didn’t use Ken as much during the Journey, but in Episode Aigis with combat being more difficult, I appreciated his kit a lot more and used him a ton!</p>\n<h4 class=\"graf graf--h4\">Metis</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*417ye600MAol0uaCEfxxug.png\" data-image-id=\"1*417ye600MAol0uaCEfxxug.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Episode Aigis</figcaption>\n</figure>\n<p class=\"graf graf--p\">The most broken character, aside from MC. Does a ton of damage, has Charge, 2 great Strike Theurgies, Wind/Ice coverage (I removed these on the final build cause I didn’t need them as much late game), Attack buff, no weaknesses, good characteristic, etc etc etc. Basically Journey Aigis and Shinji in one.</p>\n<p class=\"graf graf--p\">If you got this far, thanks for reading! I’ll definitely be making more videos/posts for Persona 3 Reload, so be sure to check out my YouTube and some other posts I have linked here. Cheers.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p graf--empty\"> </p>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/1/P3R-Key-Art.jpg",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 3 Reload"
            ],
            "date_published": "2025-01-08T09:18:00-07:00",
            "date_modified": "2025-04-18T19:38:03-06:00"
        },
        {
            "id": "https://bainz.ca/demi-fiend-boss-battle-guide-shin-megami-tensei-v/",
            "url": "https://bainz.ca/demi-fiend-boss-battle-guide-shin-megami-tensei-v/",
            "title": "Demi-Fiend Boss Battle Guide (Shin Megami Tensei V)",
            "summary": "[This article was written for base SMT V. SMT V Vengeance update&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><em class=\"markup--em markup--p-em\" style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">[This article was written for base SMT V. SMT V Vengeance update coming soon™]</em></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Along with a new Shin Megami Tensei game, comes a new challenging Super Boss fight. In SMT V, if you get the Return of the True Demon DLC, you can fight the protagonist of SMT III: Nocturne, Demi-Fiend. It’s a very hard fight, and you will need some luck in order to beat it, but with proper preparation it becomes very manageable.</p>\n<p class=\"graf graf--p\">I made a video of beating the fight using 1 single party, consisting of 4 Demons only (including Nahobino). Since I went for a Strength build, that’s what this post/video covers. The gist of this guide and strategy is contained here:</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/fXLj2No1WwU\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">To begin, there are important things to note about this fight:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">You have to kill one of Demi-Fiend’s ally Demons every 3 or so turns. If you don’t, Demi-Fiend will use Gaea Rage, a move that will do 10,000+ damage to your entire side. (He’ll cast it after he has used 6 actions and you have not killed an ally Demon recently)</li>\n<li class=\"graf graf--li\">When Demi-Fiend reaches certain HP thresholds, he will use Chaotic Will, a move that can insta-kill your Demons and halves your press turns.</li>\n<li class=\"graf graf--li\">At half HP, Demi-Fiend will use Mediarahan to heal himself and his current ally Demons to full health.</li>\n<li class=\"graf graf--li\">Demi-Fiend’s AI acts differently depending on your team’s Physical resistances. If there are party members neutral to Physical, he’ll spam Javelin Rain (40% seal chance) and Deadly Fury (100% crit rate). If all party members block Physical, he’ll spam Freikugal (Almighty move with high Crit rate). If most party members block Physical, but one resists, he’ll use Deadly Fury on the resist Demon (the resist will prevent the move from getting a crit). You can greatly lower Demi-Fiend’s damage output by keeping one or two resist Demons to redirect his attacks. If you bring in a new Demon with Repel Physical, Demi-Fiend will always attack them and lose turns.</li>\n<li class=\"graf graf--li\">If you put too many buffs on yourself, or too many de-buffs on the enemies, they will automatically use Dekaja/Dekunda. I’ve found that keeping 3 buffs on yourself and 3 de-buffs on enemies will prevent them from using Dekaja/Dekunda too often. For example, Attack/Defense/Accuracy up on the party (3). And Defense lowered by 2 stages plus Attack down 1 stage on the enemies (3). Not stacking too many buffs/de-buffs will be better for keeping them throughout the fight.</li>\n<li class=\"graf graf--li\">Two of Demi-Fiend’s ally Demons can heal: Pixie and Parvati. So they need to be taken out ASAP when they appear.</li>\n</ul>\n<p class=\"graf graf--p\">So you want to create a party that easily buff, de-buff, take care of the ally Demons and do damage to Demi-Fiend. One good party set-up for that is Shiva, Idun and Zhuque. You can of course keep additional Demons for back-up, along with these Demons. I’ll explain their roles with pictures of the builds used.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*RqxdeP5-JriTPGUSrStAmw.png\" data-image-id=\"1*RqxdeP5-JriTPGUSrStAmw.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">(Click on image for better resolution)</figcaption>\n</figure>\n<p class=\"graf graf--p\">Shiva is here to lower defense to the minimum with Tandava. You use Tandava at the start of a Magatsuhi Critical Turn to create more press turns and lower defense immediately. Shiva innately resists Physical, so he soaks up most of Demi-Fiend’s attacks. In addition, Donum Gladi is used to buff Nahobino on certain turns.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*ZKMWW328ZDlZwDFyvWRN5w.png\" data-image-id=\"1*ZKMWW328ZDlZwDFyvWRN5w.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">(Click on image for better resolution)</figcaption>\n</figure>\n<p class=\"graf graf--p\">Idun is an essential party member due to her skill Golden Apple, which is Mediarama and Luster Candy in one move. Being able to heal and buff at the same time is super valuable, especially in this fight where each turn matters. Idun also has Force Skill Potential, so she is able to do consistent damage to Girimehkala and Thor. This extra damage is crucial for taking out the ally Demons and letting Nahobino focus on Demi-Fiend. Idun is a better pick than [Spoiler Character] here, because she gets much better stats due to being fusible and Force coverage is better than [Spoiler Character’s] Light/Almighty coverage in the fight. I used a ton of Stamina Incenses to raise Idun’s MP stat.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*p6ZKkf8-DOOQ7ib64y7_zA.png\" data-image-id=\"1*p6ZKkf8-DOOQ7ib64y7_zA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">(Click on image for better resolution)</figcaption>\n</figure>\n<p class=\"graf graf--p\">Zhuque might be an unexpected pick, but they are essential for cutting down the length of the fight. Avian/Raptor race Demons get access to the Magatsuhi skill Accursed Poison. Accursed Poison will 100% apply an ailment to the enemy and casts Debilitate. Higher tier ailments are prioritized, so this skill can apply Seal to Demi-Fiend. If Demi-Fiend is sealed, he is not able to use Mediarahan, so his effective HP shrinks from 90k to 60k. You have to time it so you use Accursed Poison on the turn his HP goes below 50%, but it can make the fight drastically more manageable.</p>\n<p class=\"graf graf--p\">[<em class=\"markup--em markup--p-em\">Vengeance Edit: In SMTVV, Accursed Poison on Demi-Fiend seems to be a bit less reliable now, either because it has a lower chance rate or it doesn’t always prioritize Seal. Haven’t been able to test myself yet.]</em></p>\n<p class=\"graf graf--p\">So an Avian/Raptor Demon is required for Accursed Poison, but why Zhuque? Zhuque is the only Avian/Raptor with both Fire and Support skill potential. Fire is a great element in the fight, because both Jack Frost and Parvati are weak to it. Idun’s Force damage and Zhuque’s Fire damage can be enough to take care of the ally Demons’ HP bars. Support skill potential reduces the cost of Donum Gladi (used to buff Nahobino at times) and Matarunda. I have Matarunda instead of Debilitate, because I don’t want to lower too many stats, causing enemies to use Dekunda immediately. Matarunda also costs much less MP.</p>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Instead of building Zhuque, you could just keep an Avian/Raptor Demon in reserve and bring them in on the turn you need Accursed Poison.</strong> Make sure to put Repel Physical on this Avian/Raptor if you are bringing them in for 1 turn, so Demi-Fiend loses all his press turns when he attacks them. This would allow you to use Nuwa/Inanna/another Force Demon when Girimehkala or Thor are on the field, and Amon/Inanna/another Fire Demon when Jack Frost or Parvati are on field. That requires building more Demons, so it’s up to you.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*ar7_ZMjTZ8zda0tZzreDnA.png\" data-image-id=\"1*ar7_ZMjTZ8zda0tZzreDnA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">(Click on image for better resolution)</figcaption>\n</figure>\n<p class=\"graf graf--p\">Nahobino is on a standard Murakumo build. I added Revival Chant in case a party member died from Chaotic Will. See my Nahobino Build post for more on him. Because of the amount of ailments, insta-kills, etc., every Demon used in this fight has to have Abyssal Mask and Enduring Soul.<a href=\"https://medium.com/@bainz350/nahobino-best-build-guide-smt-v-a56f10f633cb\" data-href=\"https://medium.com/@bainz350/nahobino-best-build-guide-smt-v-a56f10f633cb\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/nahobino-best-build-guide-smt-v-a56f10f633cb\"></a><a href=\"https://medium.com/@bainz350/nahobino-best-build-guide-smt-v-a56f10f633cb\" class=\"js-mixtapeImage mixtapeImage u-ignoreBlock\" data-media-id=\"94b6c5f313dbbc0b48ca16219f7f2e1f\" data-thumbnail-img-id=\"1*i3_sbEZu0iJhXCqlhsLA6g.png\"></a></p>\n<p class=\"graf graf--p\">The basic turn order with this team is:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Activate Magatsuhi Critical skill and use Tandava on Shiva</li>\n<li class=\"graf graf--li\">Idun Golden Apple</li>\n<li class=\"graf graf--li\">Nahobino Murakumo</li>\n<li class=\"graf graf--li\">Zhuque Agibarion</li>\n<li class=\"graf graf--li\">Shiva Donum Gladi on Nahobino to buff him</li>\n<li class=\"graf graf--li\">Idun Zanbarion or item</li>\n<li class=\"graf graf--li\">Nahobino Murakumo</li>\n<li class=\"graf graf--li\">Zhuque Agibarion or Matarunda or item</li>\n</ul>\n<p class=\"graf graf--p\">On non-crit turns, use Element gems to gain press turns so Nahobino can use a Critical Gem/Critical Aura and land Murakumo. Watch the video above to see exactly how it plays out.</p>\n<p class=\"graf graf--p\">You can definitely keep more Demons in reserve, such as Cleopatra, Demeter, Nuwa, Amon, etc., in case things go sideways. Cleopatra is a great Demon in general, but in this fight, Frolic lowers too many stats (she’s still pretty good and you can use her). I like this strategy because it heavily lowers the grinding you have to do: you only need to build 3 Demons. Even with a great set-up, the fight can go south due to some combination of ailments, misses, Freikugal crits and Chaotic Will BS. But with enough perseverance, this fight is completely doable even on Hard mode.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">You can also use the Magatsuhi Adversity skill (from Beast race Demons) to end the Demi-Fiend fight in record time. <em class=\"markup--em markup--p-em\">[Vengeance Edit: SMTVV nerfed the amount of Magatsuhi gauge you get from sacrificing Demons from 30% to 15%, so this exact strat doesn’t work anymore. There are still quick Demi-Fiend kills, they just work differently.]</em></p>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/EhL19S070hw\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<p class=\"graf graf--p\">I got this strategy from a <a href=\"https://www.youtube.com/channel/UCe4F0uMR6yS3Y1w2ZWk-HJA\" data-href=\"https://www.youtube.com/channel/UCe4F0uMR6yS3Y1w2ZWk-HJA\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">YouTuber named Pser Hanser, so full credit to them.</a> View the 2-Turn video above to see my builds for this strat.</p>\n<p class=\"graf graf--p\">And check out the rest of my <a href=\"https://youtube.com/bainz\" target=\"_blank\" rel=\"noopener noreferrer\">YouTube channel</a> for more boss fights, builds and more.</p>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/13/sg-smt-v-dlc-return-of-the-true-demon.png",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Shin Megami Tensei V"
            ],
            "date_published": "2025-01-08T09:17:55-07:00",
            "date_modified": "2025-04-18T19:38:27-06:00"
        },
        {
            "id": "https://bainz.ca/nahobino-best-build-and-guide-or-smt-v/",
            "url": "https://bainz.ca/nahobino-best-build-and-guide-or-smt-v/",
            "title": "Nahobino Best Build &amp; Guide | SMT V",
            "summary": "[This article was written for base SMT V. SMT V Vengeance update&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><em class=\"markup--em markup--p-em\" style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">[This article was written for base SMT V. SMT V Vengeance update coming soon™]</em></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">In Shin Megami Tensei V, you are offered complete customizability in building the main character, Nahobino. What category you put stats into, what skills you want to have, your affinities, everything. This customizability is great, but it may leave some people with choice paralysis, not knowing exactly what the best way to go is. So I wanted to make this post going over the build I ended up with during my first playthrough.</p>\n<p class=\"graf graf--p\">Related:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/smt-v-best-demons-builds-wip-bdeadfa83e69\" data-href=\"https://medium.com/@bainz350/smt-v-best-demons-builds-wip-bdeadfa83e69\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">SMT V Best Demons &amp; Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/demi-fiend-boss-battle-guide-shin-megami-tensei-v-a524cbc6c1e6\" data-href=\"https://medium.com/@bainz350/demi-fiend-boss-battle-guide-shin-megami-tensei-v-a524cbc6c1e6\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Demi-Fiend Boss Guide — SMT V</a></li>\n<li class=\"graf graf--li\"><a href=\"https://aqiu384.github.io/megaten-fusion-tool/smt5/demons\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/smt5/demons\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">SMT V Fusion Calculator (with Skill Descriptions)</a></li>\n</ul>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Stats</h4>\n<p class=\"graf graf--p\">As you can probably tell, but I put almost all my allotted stat points into Strength. Putting points into Strength or Magic gives you a guaranteed return, your damage will just be higher, and because of how customizable Nahobino is, he can output more damage than any other Demon. Vitality is another good stat to consider, especially on Hard mode, it can sometimes make the difference between surviving or multiple game overs. Agility and Luck, in my opinion, aren’t really worth investing in. I’ve never had problems landing hits/dodging with no investment in Agility, and there’s been <a href=\"https://gamefaqs.gamespot.com/boards/204211-shin-megami-tensei-v/79767889\" data-href=\"https://gamefaqs.gamespot.com/boards/204211-shin-megami-tensei-v/79767889\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">some testing from people who save edited the game to give a Demon 999 Agility</a>, low level demons were still able to hit them. Agility can affect your likelihood to escape battles, but you can simply use Trafuri/Smoke Balls. Luck might be good on an Ailment/Poison-focused build, and for item drop rates, but otherwise it’s not too worth it.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*9SHf9PnOE5dlQuERh2zuXQ.jpeg\" data-image-id=\"1*9SHf9PnOE5dlQuERh2zuXQ.jpeg\" data-width=\"1024\" data-height=\"576\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">As for Strength or Magic, I think both routes are viable. Magic is very good early game, as it can always grant extra press turns and provides good damage. A Strength build really takes off after you get late game skills like Murakumo, a Strength-based Almighty attack with high Crit Damage. For every Story fight and the Shiva Superboss fight, both builds can work extremely well (a lot of speedrunners are actually going Magic build so far). There is the optional DLC Demi-Fiend fight, which most people go Strength build for, but I have seen Magic build runs that do well there. So go for either one, just make sure to only invest in Strength <em class=\"markup--em markup--p-em\">or</em> Magic, not both. Investing in both will make your damage pretty mediocre.</p>\n<p class=\"graf graf--p\">Aside from a Strength or Magic build, you can go for a Support/Healing build.</p>\n<p><em class=\"markup--em markup--p-em\">Vengeance Edit</em>: Nahobino got some new moves, making support build actually very good! Along with former moves like Kanabi Veil and Revival Chant:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Inflaming Divinity: Luster Candy x2 to 1 ally</li>\n<li class=\"graf graf--li\">Evergreen Dance: Greatly fills the Magatsuhi Gauge</li>\n<li class=\"graf graf--li\">Lunation Flux: Self MP Restore, Doesn’t Use Press Turn</li>\n<li class=\"graf graf--li\">Luminescent Mirage: 100% evasion from 1 attack for 1 turn (can make opponents lose press turns)</li>\n<li class=\"graf graf--li\">Intercalation (+1 Press Turn next turn if you evade an attack, pairs well with the previous skill)</li>\n</ul>\n<h4 class=\"graf graf--h4\">Skills</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*fJjCk72jxNtaDOCSGk7Euw.jpeg\" data-image-id=\"1*fJjCk72jxNtaDOCSGk7Euw.jpeg\" data-width=\"1978\" data-height=\"1112\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">For my Strength Nahobino, I went with a crit-focused Murakumo build. Murakumo, being Almighty, hits everything for neutral damage and can’t be resisted. Normal moves, when they crit, do 1.5x damage, but Murakumo has increased Crit Damage, letting you do 1.8x damage on a critical. This makes using it in conjunction with Critical Aura (next attack is guaranteed critical and 100% accurate) and Critical Zealot (decreases normal damage but increases Crit Damage) a great idea. Almighty Pleroma and High Almighty Pleroma stack and buff Murakumo. Abyssal Mask and Enduring Soul are good safety skills, preventing ailments/insta-kills and giving you 1 extra life per battle. The last skill slot is something to cover a weakness, like Repel Force.</p>\n<p class=\"graf graf--p\">A general skill path for a Strength-Almighty build would be something like this:</p>\n<ol class=\"postList\">\n<li class=\"graf graf--li\">Aramasa -&gt; Sakanagi -&gt; <strong class=\"markup--strong markup--li-strong\">Murakumo</strong></li>\n<li class=\"graf graf--li\">AoE move -&gt; Divine Arrowfall (a magic move but still good damage for your level) -&gt; Wrath Tempest -&gt; Replace with <strong class=\"markup--strong markup--li-strong\">High Almighty Pleroma</strong> at endgame because bosses generally only need single-target</li>\n<li class=\"graf graf--li\">Bloody Glee -&gt; <strong class=\"markup--strong markup--li-strong\">Critical Aura</strong></li>\n<li class=\"graf graf--li\">Hellish Mask -&gt; <strong class=\"markup--strong markup--li-strong\">Abyssal Mask</strong></li>\n<li class=\"graf graf--li\">Endure -&gt; <strong class=\"markup--strong markup--li-strong\">Enduring Soul</strong></li>\n<li class=\"graf graf--li\">Support move like Kannabi Veil/Matarukaja/etc -&gt; <strong class=\"markup--strong markup--li-strong\">Almighty Pleroma</strong></li>\n<li class=\"graf graf--li\">Extra skill slot -&gt; <strong class=\"markup--strong markup--li-strong\">Critical Zealot</strong></li>\n<li class=\"graf graf--li\">Weakness Covering Skill</li>\n</ol>\n<p class=\"graf graf--p\">This type of build will work great for both the story and super bosses. You rely on your Demons to buff/de-buff/heal, use Critical Aura and on the next turn, do a lot of damage. If you have a Magatsuhi Critical turn coming up, you can use Donum Gladi from a support to buff Nahobino beforehand. It’s worth noting that Charge is nerfed in this game, it only increases your damage by 1.8x instead of the regular 2.5x in previous games, so it’s not worth it outside of saving MP.</p>\n<p class=\"graf graf--p\">Here’s my attempt at making an example Magic-based build, for the Shiva boss fight:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Bufubarion</li>\n<li class=\"graf graf--li\">Zanbarion</li>\n<li class=\"graf graf--li\">High Ice Pleroma</li>\n<li class=\"graf graf--li\">High Wind Pleroma</li>\n<li class=\"graf graf--li\">High Restore</li>\n<li class=\"graf graf--li\">Abyssal Mask/Great Mana Spring</li>\n<li class=\"graf graf--li\">Enduring Soul</li>\n<li class=\"graf graf--li\">Weakness Covering Skill</li>\n</ul>\n<p class=\"graf graf--p\">Ice damage because Shiva is weak to Ice. Wind because Ananta, a healing Demon Shiva summons, blocks Ice but is weak to Wind. And a bunch of passives. High Restore especially can useful for conserving MP.</p>\n<h4 class=\"graf graf--h4\">Affinities</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*QmgpjPFJXVMoJVOEFBFiwg.jpeg\" data-image-id=\"1*QmgpjPFJXVMoJVOEFBFiwg.jpeg\" data-width=\"960\" data-height=\"500\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">When it comes to Nahobino’s affinities, you want to be changing them before every big boss fight in order to prevent damage and make the boss lose press turns. For example, before Nuwa, use a Null Force Essence to block her moves. As far as endgame Essences, there are a number of options:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Sandalphon</strong>: Null Phys/Elec/Light, Resist Dark, Weak to Force</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Metatron</strong>: Null Light, Resist Fire/Ice/Elec/Force</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Trumpeter (DLC)</strong>: Null Light/Dark, Resist Fire/Ice/Elec/Force</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Mother Harlot (DLC)</strong>: Repel Phys, Absorb Elec, Resist Fire/Light/Dark, Weak to Force</li>\n</ul>\n<p class=\"graf graf--p\">All these Essences require only 1 skill slot to block a weakness or nullify Physical attacks. Blocking Physical is pretty good to have in the Demi-Fiend fight, which is why I’d recommend these.</p>\n<p class=\"graf graf--p\">If you beat Demi-Fiend, you get his Essence which blocks all elements and ailments, asides from Almighty.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Those are basically my recommendations for building Nahobino. If you liked this type of post, you might like my <a href=\"https://medium.com/@bainz350/smt-v-best-demons-builds-wip-bdeadfa83e69\" data-href=\"https://medium.com/@bainz350/smt-v-best-demons-builds-wip-bdeadfa83e69\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\" rel=\"noopener\">SMT V Demon Builds</a> one. And I have a <a href=\"https://youtube.com/bainz\" target=\"_blank\" rel=\"noopener noreferrer\">YouTube channel</a> where I post build videos, boss fights, among other things.</p>\n<p class=\"graf graf--p\">What Essences have these skills? <a href=\"https://aqiu384.github.io/megaten-fusion-tool/smt5/skills\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/smt5/skills\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">This page</a> has a list of all the skills in the game and what demon they come from. But to list some of them:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Murakumo: Aogami Type-0</li>\n<li class=\"graf graf--li\">Sakanagi: Aogami Type-3</li>\n<li class=\"graf graf--li\">Aramasa: Aogami Type-1</li>\n<li class=\"graf graf--li\">Divine Arrowfall: Aogami Type-6</li>\n<li class=\"graf graf--li\">Wrath Tempest: Aogami Type-7</li>\n<li class=\"graf graf--li\">Critical Aura: Xuanwu, Matador, Jatayu, Flauros, Loup-Garou, Hecatoncheires, Odin, Asura</li>\n<li class=\"graf graf--li\">Critical Zealot: Hecatoncheires, Ganesha, Girimehkala</li>\n<li class=\"graf graf--li\">Almighty Pleroma: Aogami Type-0, Nebiros, Lilith, Huang Long</li>\n<li class=\"graf graf--li\">High Almighty Pleroma: Metatron, Shiva</li>\n<li class=\"graf graf--li\">Abyssal Mask: Aogami Type-10, Scathach, Bishamonten, Fafnir, Thor, Amon</li>\n<li class=\"graf graf--li\">Enduring Soul: Aogami Type-0, Siegfried, Cerberus, Mara, Fionn, Vishnu</li>\n</ul>\n<p class=\"graf graf--p\">What about Freikugal? -&gt; <a href=\"https://gamefaqs.gamespot.com/boards/204211-shin-megami-tensei-v/79770645\" data-href=\"https://gamefaqs.gamespot.com/boards/204211-shin-megami-tensei-v/79770645\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Murakumo vs Freikugal post by mongopikis.</a></p>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/12/1_i3_sbEZu0iJhXCqlhsLA6g.webp",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Shin Megami Tensei V"
            ],
            "date_published": "2025-01-08T09:13:08-07:00",
            "date_modified": "2025-04-18T01:23:02-06:00"
        },
        {
            "id": "https://bainz.ca/smt-v-best-demons-and-builds/",
            "url": "https://bainz.ca/smt-v-best-demons-and-builds/",
            "title": "SMT V Best Demons &amp; Builds",
            "summary": "[This article was written for base SMT V. SMT V Vengeance update&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><em class=\"markup--em markup--p-em\" style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">[This article was written for base SMT V. SMT V Vengeance update coming soon™]</em></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">With Shin Megami Tensei V being released this past week, I’ve been playing through the game and wanted to make this post to share some of the Demon Builds I’ve been using. I’ll try to update this post when I can with newer builds.</p>\n<p class=\"graf graf--p\">All the Demons here have both Abyssal Mask and Enduring Soul, mainly for the DLC Demi-Fiend fight, which has a lot of random Insta-Kill moves. Similarly, some of the supports don’t have Boon Boost/Boon Boost EX, because Dekaja and Dekunda are used so frequently in that fight. But if you’re not concerned with Demi-Fiend, you change these builds however you like.</p>\n<p class=\"graf graf--p\">Related:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/nahobino-best-build-guide-smt-v-a56f10f633cb\" data-href=\"https://medium.com/@bainz350/nahobino-best-build-guide-smt-v-a56f10f633cb\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Nahobino Best Build &amp; Guide — SMT V</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/demi-fiend-boss-battle-guide-shin-megami-tensei-v-a524cbc6c1e6\" data-href=\"https://medium.com/@bainz350/demi-fiend-boss-battle-guide-shin-megami-tensei-v-a524cbc6c1e6\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Demi-Fiend Boss Guide — SMT V</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/p/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" data-href=\"https://medium.com/p/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-5-strikers-best-personas-builds-33761a53e041\" data-href=\"https://medium.com/@bainz350/persona-5-strikers-best-personas-builds-33761a53e041\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Strikers Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/p/persona-4-golden-builds-4e6873e91089\" data-href=\"https://medium.com/p/persona-4-golden-builds-4e6873e91089\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 4 Golden Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://aqiu384.github.io/megaten-fusion-tool/smt5/demons\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/smt5/demons\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">SMT V Fusion Calculator</a> (with Skill Descriptions)</li>\n</ul>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\"><em class=\"markup--em markup--p-em\">[I’m making a new post for SMTVV stuff, but this’ll do for now:]</em></p>\n<h4 class=\"graf graf--h4\">Konohana Sakuya</h4>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/KJrrZjeNwJQ\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<h4 class=\"graf graf--h4\">Qadistu</h4>\n<p class=\"graf graf--p\">Agrat, Naamah, Lilith, Eisheth</p>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/ODDD1uUB-4k\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<h4 class=\"graf graf--h4\">Idun</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*BkAMATS6ogmfblLiy7B3bQ.png\" data-image-id=\"1*BkAMATS6ogmfblLiy7B3bQ.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Early Game Build</figcaption>\n</figure>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Laiui9nq469dS1wzl_eAdg.png\" data-image-id=\"1*Laiui9nq469dS1wzl_eAdg.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">End Game Build</figcaption>\n</figure>\n<p class=\"graf graf--p\">Idun is one of the best Demons to get mid-way through the game as she learns Golden Apple, a full-party buff and heal. It’s a really strong skill for this point in the game, allowing her to stay useful to the very end. It costs a ton of MP, but you basically only use it in boss fights anyways. I added Boon Boost, Mana Spring and Resist Elec to her skill set. Here’s a quick video on building her:</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/GYg_-RL9Fk8\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Yoshitsune</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*FH4kdJBBJ3NnSpTBp16GXA.png\" data-image-id=\"1*FH4kdJBBJ3NnSpTBp16GXA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Hassou Tobi competes with the endgame Phys skills, and always lands a critical hit, granting you an extra press turn. This combined with the fact you can fuse Yoshitsune at Level 45, makes him a great Demon to use.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/YGuCSKJ2dm8\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Cleopatra</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*CKW1yFqcewwZ7_qIt6-rww.png\" data-image-id=\"1*CKW1yFqcewwZ7_qIt6-rww.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Cleopatra, a DLC Demon, makes for a great de-buffer. Her skill Frolic can charm enemies, in addition to lowering their attack/defense by 2 stages. She has great stats, resistances, skill potentials, really no downsides. The only case where Cleopatra isn’t good is when a boss nulls Charm, thus blocking Frolic, but luckily not too many bosses pose that issue.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/fKJaWJjE0Vc\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Shiva</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Wq2jlVT72cl5pCf4zrgj0A.png\" data-image-id=\"1*Wq2jlVT72cl5pCf4zrgj0A.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Shiva’s Tandava is a really useful move because it lowers enemy defense to the minimum. Even if they’re at +1 or +2 defense, it automatically puts them at -2. This effect is very handy in the Demi-Fiend fight, and makes Shiva a great Demon to keep around. I added Donum Gladi to buff Nahobino at times, since I ran a Strength build.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/4jzTXGt1VMY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Nuwa</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*75Yfb68Qy1Hfwnh66eJT_Q.png\" data-image-id=\"1*75Yfb68Qy1Hfwnh66eJT_Q.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Nuwa, a NG+ exclusive Demon, is the best Force Demon in the game. Her skill Sacrifice of Clay can do a good amount of damage, lower enemies’ attack/defense by 1 stage and, if the foe is weak to Wind, create extra press turns. Safeguard is on here so you can use the move in the Demi-Fiend fight, without losing turns due to Null/Repel/Absorb.</p>\n<h4 class=\"graf graf--h4\">Demeter</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*cmpPGcYaqmZd4WF_owQFtA.png\" data-image-id=\"1*cmpPGcYaqmZd4WF_owQFtA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Demeter is another support Demon, her skill Eleusinian Harvest heals the entire party to 130% of their max HP. This can help a lot in boss fights to help you live more hits. Note: Even though Demeter learns High Heal Pleroma, it doesn’t do anything for her Eleusinian Harvest skill.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/Z15nK6sC26I\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Alice</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*i5MSOtF0lbEDAD1SHRlhpg.png\" data-image-id=\"1*i5MSOtF0lbEDAD1SHRlhpg.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Alice isn’t the absolute best Dark-based Demon in the game, but you get her at Level 40 and she can hold her own for a long time.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/Ur5VRG20pSk\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Metatron</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*cB7QFWe0RoU4zTmeXectrg.png\" data-image-id=\"1*cB7QFWe0RoU4zTmeXectrg.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Fire of Sinai offers the highest Almighty damage outside of MC. The downside being, it has random targeting and doesn’t have a secondary effect like Tandava.</p>\n<h4 class=\"graf graf--h4\">Beelzebub</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*gv4QJZWdnEJplkLJWuJAWA.png\" data-image-id=\"1*gv4QJZWdnEJplkLJWuJAWA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">One of the best Dark-based Demons, along with Mephisto, due to Death Flies.</p>\n<h4 class=\"graf graf--h4\">Amon</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*mBdFqo9HnXiMa1ollch_PA.png\" data-image-id=\"1*mBdFqo9HnXiMa1ollch_PA.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Best Fire Demon due to Megido Flame.</p>\n<h4 class=\"graf graf--h4\">Inanna</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*xUkdx2DUFoTaq9mlN8cfWw.png\" data-image-id=\"1*xUkdx2DUFoTaq9mlN8cfWw.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Inanna’s a Demon that’s locked behind the Chaos Route. She gets 4 strong moves in Fire, Ice, Elec and Wind, but I decided to focus her on the Ice skill. This due to the fact that there isn’t another Demon with a strong, unique Ice move. The best Ice option outside of Inanna is probably Gabriel, as she learns High Ice Pleroma and starts at +5 Ice Potential.</p>\n<h4 class=\"graf graf--h4\">Zeus</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Yi-i8s2L9O_fH_R4448-Ew.png\" data-image-id=\"1*Yi-i8s2L9O_fH_R4448-Ew.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Best Elec Demon due to Keraunos.</p>\n<h4 class=\"graf graf--h4\">Fionn mac Cumhail</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*vkt6467I8w74eGrOaS3HJg.png\" data-image-id=\"1*vkt6467I8w74eGrOaS3HJg.png\" data-width=\"1280\" data-height=\"720\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Fionn’s unique move isn’t the absolute strongest, but it has a cool animation and I liked him throughout the story, so I decided to build him.</p>\n<hr></div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure>Some extra base SMT V videos:</figure>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/ogZaboplyhY\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n<figcaption class=\"imageCaption\"></figcaption>\n</figure>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/fXLj2No1WwU\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/-oFLsWT-LtE\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<p class=\"graf graf--p graf--empty\"> </p>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/11/gqnpxcztwo571.png",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Shin Megami Tensei V"
            ],
            "date_published": "2025-01-08T09:02:50-07:00",
            "date_modified": "2025-04-18T01:22:59-06:00"
        },
        {
            "id": "https://bainz.ca/persona-5-strikers-best-personas-and-builds/",
            "url": "https://bainz.ca/persona-5-strikers-best-personas-and-builds/",
            "title": "Persona 5 Strikers Best Personas &amp; Builds",
            "summary": "As has been the case for recent Persona games, I wanted to&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">As has been the case for recent Persona games, I wanted to make a post going over my builds for NG+. These were the Personas I found to be the strongest and most useful, and the builds I ended up using on them in Merciless.</span></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Related:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" data-href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" data-href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 4 Golden Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://aqiu384.github.io/megaten-fusion-tool/p5s/personas\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/p5s/personas\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">P5S Fusion Calculator</a> (with Combo Skills, Skill Descriptions, etc.)</li>\n</ul>\n<p class=\"graf graf--p\">To max out Persona stats, I used the ‘coalescing power’ method, which involves fusing together strengthened Personas to create new ones with continually higher stats. The method can be <a href=\"https://kamigame.jp/P5S/%E6%94%BB%E7%95%A5%E3%82%AC%E3%82%A4%E3%83%89/%E5%8A%9B%E3%81%AE%E8%93%84%E7%A9%8D.html\" data-href=\"https://kamigame.jp/P5S/%E6%94%BB%E7%95%A5%E3%82%AC%E3%82%A4%E3%83%89/%E5%8A%9B%E3%81%AE%E8%93%84%E7%A9%8D.html\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">read about here</a> (use Google Translate) or you can <a href=\"https://www.youtube.com/watch?v=ebveWXb_2lU\" data-href=\"https://www.youtube.com/watch?v=ebveWXb_2lU\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">watch Rozalin’s video on the topic here</a>. Max stats aren’t necessary for any content, even on Merciless, so it’s completely optional. I should also give a shoutout to VeloPls, a speedrunner of P5S, for some inspiration behind these builds, check out their <a href=\"https://www.youtube.com/channel/UCSSk5JswHDGC1OYV5xAk5Jw\" data-href=\"https://www.youtube.com/channel/UCSSk5JswHDGC1OYV5xAk5Jw\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">YouTube channel</a> for more Strikers content (beware of some story spoilers).</p>\n<p class=\"graf graf--p\">One last thing, I do have a <a href=\"https://www.youtube.com/channel/UCnLjSxdgknngSPxvw4D9ZBA\" data-href=\"https://www.youtube.com/channel/UCnLjSxdgknngSPxvw4D9ZBA\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">YouTube channel</a> of my own where I post build guides, boss fights and other Persona/RPG content, so stop by there as I’ll likely have videos for these Personas coming out soon.<a href=\"https://www.youtube.com/channel/UCnLjSxdgknngSPxvw4D9ZBA\" data-href=\"https://www.youtube.com/channel/UCnLjSxdgknngSPxvw4D9ZBA\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://www.youtube.com/channel/UCnLjSxdgknngSPxvw4D9ZBA\"></a><a href=\"https://www.youtube.com/channel/UCnLjSxdgknngSPxvw4D9ZBA\" class=\"js-mixtapeImage mixtapeImage u-ignoreBlock\" data-media-id=\"2458cef88836b5c424810c10451ceb7d\" data-thumbnail-img-id=\"0*qABh5B05kAL08Bos\"></a></p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Lucifer</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*0ORHZtBRlfnHdB5QkrmjGg.png\" data-image-id=\"1*0ORHZtBRlfnHdB5QkrmjGg.png\" data-width=\"1920\" data-height=\"1080\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">It’s no surprise that the Persona that’s locked to NG+ is the strongest in the game. Lucifer’s exclusive skill Morning Star can be used to basically delete everything, and he also starts out with the best resistances as well. This build is centered around abusing technicals by applying Dizzy, then following up with Morning Star to break boss shields and do a lot of damage. Dizzy is the ailment used because bosses are susceptible to it, and if an opponent is inflicted, any attack on them becomes a technical. Only the Final Boss and the first phase of the Osaka Jail boss are immune to Dizzy, for every other one you can apply the ailment and start comboing them with Morning Star.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/sJReRSWaWuc\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<h4 class=\"graf graf--h4\">Alice</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*8v8axXcW_acWEMvfcDHzOQ.png\" data-image-id=\"1*8v8axXcW_acWEMvfcDHzOQ.png\" data-width=\"1920\" data-height=\"1080\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Alice is essentially the best trash mob clearer in the game. As long as a non-boss opponent doesn’t block/resist Curse, they can quickly be taken out with Die for Me. I also added Maeigaon and Curse Boost/Amp, just in case Insta-Kills don’t work in certain situations. I normally start battles with Alice equipped, as she clears dungeons the fastest, so I put Attack/Speed Master on her to always start out with those buffs, without having to continually swap Personas. Alice’s combo skills of Concentrate, Mamudoon and Megidolaon are also some of the best in general.</p>\n<h4 class=\"graf graf--h4\">Metatron</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*7Dx4xlZrCcu0RTGdQXSseA.png\" data-image-id=\"1*7Dx4xlZrCcu0RTGdQXSseA.png\" data-width=\"1920\" data-height=\"1080\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Metatron is the Bless-based counterpart to Alice, which is why I gave him Mahamaon, to deal with any enemies that block Curse insta-kills. Mahamaon has a lower chance for insta-kill than Die for Me, but it has a much wider range, making Metatron just as good for dungeon clearing. I kept Sword Dance and added Knockdown Style (Greatly decreases Down Gauge when landing a critical hit) just for when I felt like using the Physical skill instead of magic ones.</p>\n<h4 class=\"graf graf--h4\">Yoshitsune</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*UHTmlwHyKGAKl5Qi4MlWRQ.png\" data-image-id=\"1*UHTmlwHyKGAKl5Qi4MlWRQ.png\" data-width=\"1920\" data-height=\"1080\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">One of the strongest Personas from previous games returns, and is no disappointment. Yoshitsune’s Hassou Tobi continues to be a very good skill (though it’s not the strongest anymore, see the damage video I did below), and can be used to clear both mobs and bosses. This build is centered around applying Shock with Wild Thunder (most bosses are still susceptible to it), which allows for Phys skills like Hassou Tobi to become a technical, letting it easily break shields and hit for more damage. Yoshitsune can’t inherit Magic skills, so I had to use a skill card for Wild Thunder, but even Zio could be used in that slot as it’s being used for the ailment more so than damage. If an Elec skill card can’t be found, Freeze or Dizzy can work in place of Shock. Salvation is on here to quickly heal (Hassou Tobi costs 30% HP) without having to swap Personas, but it could be replaced by just Diarahan or the healing skill could be on a separate Persona.</p>\n<h4 class=\"graf graf--h4\">Black Frost</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*xsRqXwqkvFfJ5ajcsuFmbA.png\" data-image-id=\"1*xsRqXwqkvFfJ5ajcsuFmbA.png\" data-width=\"1920\" data-height=\"1080\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Black Frost’s build is based around the same idea as Yoshitsune, just with applying Freeze and following up with a strong Phys skill. Agneyastra is actually the highest damage Phys move in the game, above even Hassou Tobi (see damage vid below).</p>\n<h4 class=\"graf graf--h4\">Arsene</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*VmRdtP6onir0eZg1gshj3w.png\" data-image-id=\"1*VmRdtP6onir0eZg1gshj3w.png\" data-width=\"1920\" data-height=\"1080\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Have to keep the starter around and I stuck with the same build for Arsene as Lucifer, because Dizzy+Almighty can be used to beat almost every boss. This type of build is of course better on Lucifer, because Morning Star does about 50% more damage than Megidolaon, but I still tend to use Arsene more often. The remaining skills slots are taken up by Debilitate and Heat Riser, which are some of the best skills in the game and can be put on any Persona. Arsene actually has a full skill tree for once, learning Maeigaon and Riot Gun at later levels, so a Curse or Gun Build could also work for him.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<figure class=\"graf graf--figure graf--iframe\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/8podzML-Mz8\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</figure>\n<p class=\"graf graf--p\">Two things might be noticeable for these Personas. One is that most have a weakness or two which isn’t patched up, the reason being that you can often keep a boss permanently staggered by hitting their weakness or a technical, giving them little opportunity to target you, so your own weak point doesn’t matter as much. But if you find yourself getting hit and knocked down many times, Resist/Null skills can be added in place of other ones.</p>\n<p class=\"graf graf--p\">The second thing is the lack of Charge/Concentrate. In previous Personas, using those skills was a no brainer because it resulted in the next turn’s attack doing 2.5x damage. In Strikers, using Charge/Conc has the same effect, but due to the action style of the game, taking time to use those skills can feel unnecessary. The timer of how long an enemy is inflicted with an ailment continues to go down when casting Charge/Conc, so it often seems better to attack as many times as possible during that window, instead of powering up for one stronger attack. It’s basically personal preference, but I rarely feel the need to use those skills this time around.</p>\n<p class=\"graf graf--p\">Most builds on here center around ailments and capitalizing on them, so they’re most effective with a high Luck stat and the Bond skill ‘Luck Boost’ levelled as high as possible. Ailments and insta-kills will feel a lot weaker otherwise.</p>\n<p class=\"graf graf--p\">As can be seen by Arsene, any Persona can be usable if you invest stats into them. Some other good Personas, based on their element, what skills they learn and what combos they have:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Fire: Cerberus, Mara</li>\n<li class=\"graf graf--li\">Ice: King Frost</li>\n<li class=\"graf graf--li\">Elec: Thor, Raja Naga</li>\n<li class=\"graf graf--li\">Wind: Norn, Fortuna</li>\n<li class=\"graf graf--li\">Psy: Forneus, Kali</li>\n<li class=\"graf graf--li\">Nuke: Mot, Trumpeter, Ganesha</li>\n<li class=\"graf graf--li\">Curse: Abaddon</li>\n<li class=\"graf graf--li\">Gun: Seth</li>\n</ul>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/10/1_L3lzT9PvgUQpj07ovbjBcg.webp",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 5 Strikers"
            ],
            "date_published": "2025-01-08T08:59:19-07:00",
            "date_modified": "2025-04-18T01:22:54-06:00"
        },
        {
            "id": "https://bainz.ca/persona-4-golden-party-member-builds/",
            "url": "https://bainz.ca/persona-4-golden-party-member-builds/",
            "title": "Persona 4 Golden Party Member Builds",
            "summary": "Just as I did for P5R, I thought I’d make a post&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Just as I did for P5R, I thought I’d make a post going over the builds/skill sets I had for each party member in P4G at the end of my first playthrough (these were on Vita), and talk about each character a bit.</p>\n<p>For Yu’s Personas, check out this post: <a href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" data-href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\"><strong class=\"markup--strong markup--mixtapeEmbed-strong\">Persona 4 Golden Builds.</strong></a></p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/bVPEeyplC7Y\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Related:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" data-href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 3 Reload Party Member Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" data-href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" data-href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">P5R Party Member Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://aqiu384.github.io/megaten-fusion-tool/p4g/personas\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/p4g/personas\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">P4G Fusion Calculator</a> (with Skill Descriptions)<a href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" data-href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\"></a><a href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" class=\"js-mixtapeImage mixtapeImage u-ignoreBlock\" data-media-id=\"6734c06f953258cda00f5b53047fa86d\" data-thumbnail-img-id=\"1*9pXztMQMRvpp0PIQcbcY3Q.jpeg\"></a></li>\n</ul>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Yosuke</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*YUFh-9cHFuGPj1hZYhwhHg.png\" data-image-id=\"1*YUFh-9cHFuGPj1hZYhwhHg.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Compared to most of the other members, Yosuke is well balanced in both Phys and Magic. His supports of Masukukaja/Youthful Wind and Dekaja can prove useful at multiple points, especially against Golden Hands, who like to boost their evasion. The lack of Power/Mind Charge puts him a bit below the other members in boss fights, but he’s still solid overall.</p>\n<p class=\"graf graf--p\">S. Link Skills: Trafuri, Dekaja, Auto-Sukukaja, Diarama, Evade Elec</p>\n<p class=\"graf graf--p\">Bike Skills: Confuse Boost, Megido, Green Wall, Makara Break, Diarahan</p>\n<h4 class=\"graf graf--h4\">Chie</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Ux3kGcVRtF4aZDfw8g3a7w.png\" data-image-id=\"1*Ux3kGcVRtF4aZDfw8g3a7w.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">For Chie, I went strictly with Phys skills for her, as the best Ice move she learns normally is Bufula and she only gets Ice Boost (no Amp). After 5 Bike Rides, she does learn Bufudyne, but I didn’t think it was worth it (at least on a 1st playthrough). Bufula could be kept instead of High Counter here. So I stuck with God’s Hand/Agneyastra, and her critical buffing skills of Revolution and Apt Pupil. Dragon Hustle (party Heat Riser) is a great 3rd tier skill, despite it costing 150 SP. Due to Chie’s low SP pool, it’d prob be worth equipping the Chakra Ring (halves SP cost of skills, can be found after beating the 6th Dungeon optional boss) when using that move.</p>\n<p class=\"graf graf--p\">S. Link Skills: Rebellion, Ice Boost, Revolution, Bufula, Evade Fire</p>\n<p class=\"graf graf--p\">Bike Skills: Hama, Mind Slice, Hamaon, Tetra Break, Bufudyne</p>\n<h4 class=\"graf graf--h4\">Yukiko</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*3Dp3g-bun8Jf4Os9jHwaZQ.png\" data-image-id=\"1*3Dp3g-bun8Jf4Os9jHwaZQ.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">As these builds are from my first playthrough, I didn’t have the chance to take Yukiko on 5 Bike rides, but Mind Charge is definitely worth doing that (it would replace Agidyne here). With Burning Petals (Severe Fire damage to all), Yukiko can actually come close to Yu in terms of magic damage. She’s also a great healer to have in the party, and prior to learning Mediarahan/Salvation, Divine Grace and Amrita are good skills to keep on her.</p>\n<p class=\"graf graf--p\">S. Link Skills: Mudo, Divine Grace, Amrita, Mudoon, Evade Ice</p>\n<p class=\"graf graf--p\">Bike Skills: Valiant Dance, Matarunda, Red Wall, Spirit Drain, Mind Charge</p>\n<h4 class=\"graf graf--h4\">Kanji</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*8mnxUAnz23GnIZgm5rxWMg.png\" data-image-id=\"1*8mnxUAnz23GnIZgm5rxWMg.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Kanji just hits hard. Even though he only learns single-target Phys skills by level up, I used him more than Chie, as he’s stronger and bosses tend to only require single-target anyway (though Chie is good for dungeons because she gets Apt Pupil). Given that Kanji favors Phys skills, Regenerate 3 was chosen over Elec Boost. Before learning The Man’s Way (Chance of causing Down and Dizzy to all), I kept Masukunda for the whole time prior.</p>\n<p class=\"graf graf--p\">S. Link Skills: Dizzy Boost, Masukunda, Power Charge, Regenerate 3, Evade Wind</p>\n<p class=\"graf graf--p\">Bike Skills: Media, Atom Smasher, Blue Wall, Fast Heal, Mediarama</p>\n<h4 class=\"graf graf--h4\">Teddie</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*yZ6lx1ddMH2c0O9869h6qQ.png\" data-image-id=\"1*yZ6lx1ddMH2c0O9869h6qQ.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Teddie is the second healer of the group and he gets the Ice skills that Chie doesn’t. I tended to use Yukiko over Teddie for healing, because Yukiko learns Divine Grace naturally, but an accessory named Blessed Hands (from Tanaka’s Amazing Commodities) can be equipped for Teddie to have Divine Grace as well. Despite being a bit overshadowed by Yukiko, having Teddie in the same party as Yukiko can let her focus on attacking instead of healing, leaving Teddie to be the heal/support member, which he isn’t that bad at. Kamui Miracle, Teddie’s 3rd Tier skill, can replace one of these moves (if you like RNG). One skill not on here is Marakunda (all enemy defense down), I replaced it due to MC having Debilitate later on, but prior to that it’s a very good move to keep. Matarukaja can also be kept if you’re not using Kanji.</p>\n<p class=\"graf graf--p\">S. Link Skills: Auto-Rakukaja, Recarm, Marakunda, Samarecarm, Evade Elec</p>\n<p class=\"graf graf--p\">Bike Skills: Dekunda, Life Drain, Mustard Bomb, White Wall, Evade Physical</p>\n<h4 class=\"graf graf--h4\">Naoto</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*CODN8-byTb3NZGW8fCrl_Q.png\" data-image-id=\"1*CODN8-byTb3NZGW8fCrl_Q.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Naoto’s really a character that gets too many good skills. She gets the 4 high tier Elementals, both multi-target Insta-Kills, Megidolaon, Vorpal Blade/Myriad Arrows, Tetrakarn/Makarakarn and even Angelic Grace. With the number of skills she learns, I don’t think there’s an ‘optimal’ Naoto build, it kinda comes down to personal preference.</p>\n<p class=\"graf graf--p\">I went with Mahamaon and Mamudoon (along with Hama/Mudo Boost) for clearing mobs, and Mind Charge+Megidolaon for boss fights. I preferred using the insta-kill moves with Naoto, but keeping the elemental skills isn’t bad either. Shield of Justice (Shields the party from all damage once) costs 160 SP and is too niche to be used often outside of Super Boss fights, so it could be replaced with something else (I had Invigorate 3 prior).</p>\n<p class=\"graf graf--p\">S. Link Skills: Invigorate 1, Mind Charge, Invigorate 2, Heat Riser, Invigorate 3</p>\n<p class=\"graf graf--p\">Bike Skills: Bufudyne, Ziodyne, Tetraja, Myriad Arrows, Angelic Grace</p>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/9/1_wNXwfuY6KmfSixNUQL2okA.png",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 4 Golden"
            ],
            "date_published": "2025-01-08T08:54:47-07:00",
            "date_modified": "2025-04-18T01:22:50-06:00"
        },
        {
            "id": "https://bainz.ca/persona-4-golden-builds/",
            "url": "https://bainz.ca/persona-4-golden-builds/",
            "title": "Persona 4 Golden Best Personas &amp; Builds",
            "summary": "With Persona 4 Golden being released on Steam/PC, I thought it’d make&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">With Persona 4 Golden being released on Steam/PC, I thought it’d make sense to make two posts similar to my previous ones for P5R, going over some of the best Personas available for the MC, Yu Narukami (/Souji Seta), as well as the skill sets of each party member. For Yu, the builds here are still a work in progress and I’ll try to update this post as I’m able to make more that are worth posting.</span></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Most of the moves on these Personas were added using Skill Cards. Skill Cards can either be gotten through Shuffle Time or by going to the cafe in Okina City with different Personas equipped. To raise stats, I used Growth 3 to get them to Level 99, then farmed Stat Up cards during Shuffle Time.<a href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" data-href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\"></a><a href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" class=\"js-mixtapeImage mixtapeImage u-ignoreBlock\" data-media-id=\"91b4708b519d0a07479445c28329f09a\" data-thumbnail-img-id=\"1*wNXwfuY6KmfSixNUQL2okA.jpeg\"></a></p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/bVPEeyplC7Y\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">Related:</p>\n<ul class=\"postList\">\n<li><a href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" data-href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\"><strong class=\"markup--strong markup--mixtapeEmbed-strong\">Persona 4 Golden Party Member Builds</strong></a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" data-href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" data-href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">P5R Party Member Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://aqiu384.github.io/megaten-fusion-tool/p4g/personas\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/p4g/personas\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">P4G Fusion Calculator</a> (with Skill Descriptions)</li>\n</ul>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Yoshitsune</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*y2Ap-9T2Qr5VtmR4abharw.png\" data-image-id=\"1*y2Ap-9T2Qr5VtmR4abharw.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/2MGEUlZ2BWQ\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n<div class=\"iframeContainer\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Hassou Tobi is so strong that even if an opponent resists physical, it can do more damage than a severe elemental skill like Ragnarok. So yeah, Yoshitsune is broken. Ali Dance and Enduring Soul are on here to dodge/survive the Megidolaons in the Super Boss fight.</span></div>\n</div>\n</figure>\n<h4 class=\"graf graf--h4\">Trumpeter</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*CYJQFO74W8YimYbErrq7vQ.png\" data-image-id=\"1*CYJQFO74W8YimYbErrq7vQ.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/BsQOmb8zoC0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Trumpeter naturally learns Debilitate and Heat Riser, and Rank 10 of Margaret’s S. Link requires showing her a Trumpeter with Mind Charge. Given this, he’s basically the de facto Support Persona in P4G. It helps that you only need 3 skills to make him invincible to everything but Almighty.</p>\n<h4 class=\"graf graf--h4\">Helel</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*uYq-jzi-CWbrDwkwr3vMQA.png\" data-image-id=\"1*uYq-jzi-CWbrDwkwr3vMQA.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Morning Star is the best Almighty move and exclusive to Helel. Almighty magic isn’t as strong as other elements due to no Boost/Amp in P4G, but in exchange it can never be blocked/resisted.</p>\n<h4 class=\"graf graf--h4\">Izanagi</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Q8SacHHgmx2b2wF4ApjJcg.png\" data-image-id=\"1*Q8SacHHgmx2b2wF4ApjJcg.png\" data-width=\"1378\" data-height=\"773\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">As with other Persona games, I like keeping the starter around to the end. For Izanagi, I went with Maziodyne and Primal Force as the skills. Maziodyne cause Electric is Izanagi’s thing, and Primal Force cause even though it’s weaker than Hassou Tobi, it has a much higher crit rate.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Other great Personas:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Alice</strong> and <strong class=\"markup--strong markup--li-strong\">Daisoujou</strong> have the best Insta-Kill moves in Die for Me! and Samsara</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Surt</strong> (Fire), <strong class=\"markup--strong markup--li-strong\">Loki</strong> (Ice), <strong class=\"markup--strong markup--li-strong\">Thor</strong> (Elec), <strong class=\"markup--strong markup--li-strong\">Odin</strong> (Wind) have the best Elemental moves</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Shiva</strong> has the 2nd best Phys move in Pralaya (Severe damage to all foes with a high chance of instant-kills)</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Black Frost</strong> is likely one of the best Personas for a 1st playthrough, due to having no weaknesses and learning Agidyne/Fire Amp at a low level</li>\n<li class=\"graf graf--li\">Personas not on here that need only 3–4 skill slots to block everything but Almighty: Beelzebub, Black Frost, Byakko, Yatsufusa, Mahakala, Ongyo-Ki, Neko Shogun, White Rider, Arahabaki</li>\n</ul>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/8/1_cz97DqG8yiPh2G2k3lz-rQ.png",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 4 Golden"
            ],
            "date_published": "2025-01-08T08:50:35-07:00",
            "date_modified": "2025-04-18T01:22:42-06:00"
        },
        {
            "id": "https://bainz.ca/lavenza-boss-fight-guide-persona-5-royal/",
            "url": "https://bainz.ca/lavenza-boss-fight-guide-persona-5-royal/",
            "title": "Lavenza Boss Fight Guide  (Persona 5 Royal)",
            "summary": "Note: Third Semester spoilers, of course. Lavenza was added as a new&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><strong class=\"markup--strong markup--p-strong\" style=\"font-family: var(--editor-font-family); font-size: inherit;\"><em class=\"markup--em markup--p-em\">Note</em></strong><em class=\"markup--em markup--p-em\" style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: Third Semester spoilers, of course.</em></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Lavenza was added as a new Super Boss in Persona 5 Royal, available during the 3rd Semester in NG+ (after securing a route to the treasure in the Final Palace). She is a fair bit tougher than the Twins, and her fight has various requirements that you have to fulfill in order to beat it. I posted two videos recently, one beating Lavenza with a full party and one with solo Joker. First part of this post will focus on beating Lavenza with a full party, second half is with the solo route.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/OMx1z3q2a_I\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/kYxoDsrBHcQ\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Party</h4>\n<p class=\"graf graf--p\">Lavenza has 4 Phases and moves twice per turn. She periodically uses Dekaja to remove buffs on the party and Dekunda to remove de-buffs on herself. In Phases 1–3, you must deal 5000 damage within 8 of your turns, or she will knock down your party and end the fight.</p>\n<p class=\"graf graf--p\">Phase 1 has these characteristics:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Lavenza will start by using Dekaja on the party to remove buffs, and Heat Riser on herself</li>\n<li class=\"graf graf--li\">She’ll then start trying to apply ailments and rotate between Fire, Electric, Ice and Wind damage</li>\n<li class=\"graf graf--li\">After Lavenza has just finished her turn, she takes more damage from certain elements. After Fire, she takes more damage from Ice attacks. If Electric, then Wind. If Ice, then Fire. If Wind, then Electric.</li>\n<li class=\"graf graf--li\">Lavenza seems to have a hidden resistance to Almighty during this phase, so using the right element will really do more damage than anything else</li>\n</ul>\n<p class=\"graf graf--p\">Phase 2:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">In this phase, Lavenza is susceptible to all ailments. You must deal Technical damage every turn, or the fight ends.</li>\n<li class=\"graf graf--li\">Here’s a <a href=\"https://megamitensei.fandom.com/wiki/Status_Changes_in_Persona_5\" data-href=\"https://megamitensei.fandom.com/wiki/Status_Changes_in_Persona_5\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">list of ailments in P5R and what can be used for a Technical</a></li>\n<li class=\"graf graf--li\">Sleep/Dizzy allows for any attack to be a Technical, while Rage halves Lavenza’s defense</li>\n<li class=\"graf graf--li\">She can use Bless/Curse insta-kills during this part so watch out for those</li>\n</ul>\n<p class=\"graf graf--p\">Phase 3:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Lavenza loses her resistance to Physical/Gun attacks during this phase</li>\n<li class=\"graf graf--li\">You must land a critical hit every turn, or the fight ends</li>\n</ul>\n<p class=\"graf graf--p\">Phase 4:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">This phase doesn’t have any requirements, you just need to finish off Lavenza’s health bar</li>\n<li class=\"graf graf--li\">Lavenza will use a physical attack (her chainsaw) almost every time after a party member acts</li>\n<li class=\"graf graf--li\">Lavenza is neutral to Wind/Elec/Psy after using Atavaka, and Wind/Ice/Nuke after using Thor</li>\n<li class=\"graf graf--li\">After 5 party turns, Lavenza will use Concentrate + Megidolaon, which is a one-shot to everyone no matter what. But, if Joker has a Persona with Enduring Soul equipped, he’ll live and restore all HP (as long as Enduring Soul wasn’t used up prior to this point).</li>\n</ul>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*muWZtwaI2tbO_c53nLKlJQ.png\" data-image-id=\"1*muWZtwaI2tbO_c53nLKlJQ.png\" data-width=\"1440\" data-height=\"809\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">The party I used for most of this fight was Makoto, Haru and Sumire. Makoto because you need a healer, and Makoto’s endgame stats tend to be a lot higher than Morgana’s due to her ultimate gun that gives +11 All Stats. Ryuji could be swapped in as the healer if you have sufficient Somas/Bead Chains or the Salvation Crown, as his Tier 3 skill Fighting Spirit can benefit Haru/Sumire.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*_KxPpk0P3CbGKa409IdBYw.png\" data-image-id=\"1*_KxPpk0P3CbGKa409IdBYw.png\" data-width=\"1440\" data-height=\"808\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Haru is in the party because she can land technicals off nearly all ailments with Psiodyne, land criticals using One-Shot Kill, her trait lowers ailment susceptibility by 50% and her tier 3 skill Life Wall can be useful during the last phase. Sumire can raise the critical rate of the whole party and land criticals with the most consistency due to Sword Dance and Apt Pupil. Sumire’s trait Veil of Midnight also has a chance to prevent allies from being downed when their weaknesses are hit. I switched Yusuke in for Makoto during Phase 4, because his trait helps the party avoid Lavenza’s chainsaw attacks, but it’s def not 100% necessary. This is the just the party I prefer using, not necessarily the most ‘optimal’ one. Accessories: Apt Pupil for Haru (Advanced Home Run Mini-Game or Itemize Tsukiyomi), Orichalcum R for Sumire (Itemize Orichalcum), Salvation Crown for Makoto (Tanaka’s Shady Commodities).</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*NMqY9HDIx0JhiSpbKYCq8w.png\" data-image-id=\"1*NMqY9HDIx0JhiSpbKYCq8w.png\" data-width=\"1440\" data-height=\"809\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">The basic strategy was Concentrating with Joker first, Makoto could heal/support, then Haru and Sumire would go for crits with One-Shot Kill and Sword Dance, Baton Passing to Joker for the big damage hit. You don’t need max stats on Joker’s Personas btw, they just help in speeding things up.</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Phase 1, start with a Will of the Sword Persona equipped on Joker. Will of the Sword is bugged to give an Auto-Concentrate when you begin with it, and Dekaja can’t remove Concentrate. I had Jack Frost and Baal with Diamond Dust and Panta Rhei to deal damage. With Crits and Baton Passes (and good RNG), this phase can end in a couple turns.</li>\n<li class=\"graf graf--li\">Phase 2, casting Rage on Lavenza halves her defense, Haru Psiodyne and Joker Psycho Force (with Kohryu’s Universal Law) can end the phase in 1 turn.</li>\n<li class=\"graf graf--li\">Before Phase 3, ideally have Sumire use Brave Step. Then just hope you land a crit with someone, and do as much damage as possible when Lavenza is downed.</li>\n<li class=\"graf graf--li\">Phase 4 is actually where you can breathe a little bit. If Joker has an Enduring Soul Persona, you really have 10 of your turns to finish off Lavenza. You almost want to get to the Megidolaon turn, because if Lavenza knocks everyone out but Joker, Futaba’s Ultimate Support can activate, reviving/healing everyone and giving the whole party Heat Riser. Just keep chipping Lavenza down until you win. (If Ultimate Support doesn’t activate after the others die, use Maria’s Holy Benevolence or a Revive-All item from Takemi.)</li>\n</ul>\n<p class=\"graf graf--p\">Speaking of Futaba, how well your fight with Lavenza goes can often just come down to whether you get good RNG with Futaba’s support skills. If Futaba gives you full party Charge/Concentrate or Ultimate Support often, it can be a breeze. Or, she can just not show up at all.</p>\n<p class=\"graf graf--p\">That is basically the gist of the fight. You can watch the video I posted to see how it plays out turn by turn, and I showed the Personas I used near the end.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Solo (with DLC)</h4>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/1jjjOr5b-o4\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">Beating Lavenza solo is a bit different. Because you don’t have party members, reaching the 5000 damage thresholds and landing technicals by yourself every turn can seem impossible. But luckily, it is possible and made a lot easier with the help of DLC. Credit to a <a href=\"https://www.youtube.com/user/iisroking\" data-href=\"https://www.youtube.com/user/iisroking\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Youtuber named 藍山</a>, who had a great breakdown on how to complete this fight solo.</p>\n<p class=\"graf graf--p\">In Phase 1, Lavenza’s pattern is always the same. It’s Wage War (Rage)+Fire, Nocturnal Flash (Dizzy)+Electric, Lullaby (Sleep)+Ice and Tentarafoo (Confuse)+Wind. So if you come in with the right Personas, you can take 0 damage and deal the 5000 damage needed. Start with a Will of the Sword Persona equipped, because the bug will give you Auto-Concentrate. Next, the most important Persona is either Asterius or Izanagi-no-Okami. Asterius’ trait Frenzied Bull, “Increases damage to foes when low on HP”, this means that when you are below 50% HP, Frenzied Bull doubles your damage. Izanagi-nO’s trait Country Maker, “Increases Attack/Defense based on Inmate Registry completion”, meaning when you have a full Persona compendium it doubles your damage. Both these traits provide the same 2x multiplier, Frenzied Bull just requires you to be below 50% HP, Country Maker is best with a full compendium. You want to have Panta Rhei on either of these Personas, because you’ll attack after Lavenza has used an Electric move.</p>\n<p class=\"graf graf--p\">Otherwise, you’ll need a support Persona (or multiple support Personas) with Debilitate, Rebellion and Concentrate. This Persona should have the trait Positive Thoughts or Wealth of Lotus to extend their buffs by 2 turns (for Rebellion). This Persona should also ideally block Fire, Ice, Elec and Wind, with its natural resistances and/or using Null/Drain/Repel passives. If you block everything Lavenza uses in Phase 1, then you can rely on Insta-Heal (passive or via an accessory) to heal from the ailments she uses. Once you have the right Persona(s), the Phase 1 turn order is just:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Debilitate/Dekaja, Debilitate/Heat Riser, Panta Rhei, Concentrate, Rebellion, Debilitate, Panta Rhei</li>\n</ul>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*6Pb80OtI6v7zeFP5YU3tDQ.png\" data-image-id=\"1*6Pb80OtI6v7zeFP5YU3tDQ.png\" data-width=\"1440\" data-height=\"809\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">That’ll get you to Phase 2, where you have to land a technical every turn. This is the part where it’s all luck based. Going into the fight, you need to have the Cocytus Ice gun equipped (from the Airsoft shop), because it will allow you to freeze Lavenza. You need to freeze her using one of your first 3 bullets, then technical using another bullet. This will count as your technical hit for the turn, and you’ll get a 1 More, where you should Concentrate using either the Persona you had equipped, the Ring of Greed accessory or a Star Onion. Then on the next turn, your goal is to crit Lavenza using a physical move that applies Sleep/Dizzy (Dream Needle, Dormin Rush, Sledgehammer, Flash Bomb). Dream Needle seems to be the best because it can be used in conjunction with Apt Pupil and Trigger Happy, plus it has a Medium chance of Sleep. Knocking her down here and applying the ailment will allow you to switch to the highest damaging Persona you have (namely Izanagi-no-Okami with Myriad Truths), and hit the technical while Lavenza is down. A Concentrated Myriad Truths here does over 11k damage, letting you entirely skip the whole Critical Hit Phase 3 of the fight. Putting Repel Fire on Izanagi-nO can be useful, because Lavenza will always use Blazing Hell after Phase 2 is done.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*alkyxL_oO-7vWogw9_MKkA.png\" data-image-id=\"1*alkyxL_oO-7vWogw9_MKkA.png\" data-width=\"800\" data-height=\"448\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Given the requirements of Phase 2, the solo success rate is not high. In my experience, you land a Freeze using your first 3 bullets about 50% of the time. And then getting the crit/ailment afterwards is like a… 20–30% chance. So it’s about a 1/8 chance you get past Phase 2 using this method.</p>\n<p class=\"graf graf--p\">Once you finish Phase 2 and skip Phase 3, Phase 4 is very simple. Just concentrate and Myriad Truths until it’s finished. Check out the posted video above if any of this didn’t make complete sense (I have all the Personas I used included at the end).</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Solo (No DLC)</h4>\n<p class=\"graf graf--p\">Beating Lavenza Solo without DLC is similar to the previous section, but it requires many more attempts due to the amount of RNG present. <a href=\"https://www.youtube.com/channel/UClA2oEpslLQBih5kfsGCZaQ\" data-href=\"https://www.youtube.com/channel/UClA2oEpslLQBih5kfsGCZaQ\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Big credit to RobLu L</a> (<a href=\"https://youtu.be/8q66mIUz4D0\" data-href=\"https://youtu.be/8q66mIUz4D0\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">check out their Lavenza vid</a>), I thought this fight was likely impossible without DLC, until I saw their strategy for Phase 3. If attempting solo, I’d recommend just using Izanagi-nO, cause it would save a lot of time. But if interested in knowing how the No DLC route works, read ahead.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*kE9xy9_PgDZwTnc7qOuVHA.png\" data-image-id=\"1*kE9xy9_PgDZwTnc7qOuVHA.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">In Phase 1, the pattern was Dekaja/Debilitate, Ice damage, Concentrate, Fire damage, Concentrate, Debilitate, Critical (One-Shot Kill/Sword Dance) and Wind damage. With Repels (from a Persona with Retaliating Body), this allows you to deal 5000+ damage and end the phase with Lavenza’s stats lowered. The Ice and Fire Personas were Jack Frost and Surt with Intense Focus (Mighty Gaze and Will of the Sword also work). The Wind Persona was Satanael, as he has max magic damage due to Tyrant’s Mind (not counting DLC obvs). The critical in this phase boosts on the damage on the Wind attack, letting the Phase end before Lavenza uses Dekunda.</p>\n<p class=\"graf graf--p\">For Phase 2, having Lavenza’s stats lowered beforehand matters because she starts the phase with Heat Riser. If Lavenza’s evasion is raised here, it makes the following steps even less reliable, so that’s why it’s important. Next is the Freeze (or Shock) technical with the gun, and the Dream Needle critical/ailment. Once these are applied, Kohryu should be used for his trait Universal Law (Technical damage +50%), doing ~6.5k damage and ending the phase.</p>\n<p class=\"graf graf--p\">In Phase 3, Lavenza can use Tetrakarn, making it impossible to progress alone. But you can force Lavenza to not use Tetrakarn by using Personas that are weak to her attacks (Psy/Nuke). Lavenza will go after Joker’s weaknesses instead of setting up Tetrakarn, and this is why Kohryu and Arahabaki are used. <a href=\"https://www.reddit.com/r/Persona5/comments/gktce4/testing_p5rs_battle_mechanics_part_2_evasion/\" data-href=\"https://www.reddit.com/r/Persona5/comments/gktce4/testing_p5rs_battle_mechanics_part_2_evasion/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Ali Dance and Angelic Grace don’t stack</a> so using Evade skills, with Enduring Soul, is the best bet on these two.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*DN3d-lBRXtYJFRjFZ0JQGg.png\" data-image-id=\"1*DN3d-lBRXtYJFRjFZ0JQGg.png\" data-width=\"1440\" data-height=\"809\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">One-Shot Kill with Gun Boost/Amp and Trigger Happy can also be used here</figcaption>\n</figure>\n<p class=\"graf graf--p\">As Arahabaki was the Critical dealing Persona, I put Vitality of the Tree (Allows use of ambushed skills normally) and Adverse Resolve (Critical rate up when ambushed) on him. <a href=\"https://www.reddit.com/r/Persona5/comments/gkthop/testing_p5rs_battle_mechanics_part_3_critical_hits/\" data-href=\"https://www.reddit.com/r/Persona5/comments/gkthop/testing_p5rs_battle_mechanics_part_3_critical_hits/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">Based on this post by bryanktr</a>, Adverse Resolve does work with Vitality of Tree (although other passives like Last Stand don’t). That’s why Vitality of the Tree was on the critical-hit Personas (Attis, Rangda, Arahabaki). I used Sword Dance instead of One-Shot Kill because it allowed for more space for passives like Regenerate 3 and Evade Psy/Nuke. Even with Apt Pupil and Adverse Resolve, a critical hit cap of 60% exists in P5R, so Undying Fury (Phys skills +30%) could be used instead of Vitality of the Tree. This Phase requires 2–3 crits, depending on if Futaba buffs your attack or if you dodge Lavenza’s moves (which prevents her from using Dekunda). Debilitate/Heat Riser and Hassou Tobi are the best moves after getting a critical.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*vz3Dwv_KJeriuo050OlwTw.png\" data-image-id=\"1*vz3Dwv_KJeriuo050OlwTw.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Endure and Enduring Soul work separately, so Endure can be used for this Persona (you don’t need HP in Phase 4)</figcaption>\n</figure>\n<p class=\"graf graf--p\">Phase 4 is the simplest, just equip a Repel All Persona with Retaliating Body (Gun/Fire/Elec can be Drain/Null instead of Repel bc Lavenza blocks those) and lower defense. Repelling everything does more damage than attacking in this part. One of either Endure, Enduring Soul or Futaba’s Final Guard needs to last until this point to make it past Lavenza’s Megidolaon with Lucifer. If you make it this far, congrats! This is definitely the hardest challenge fight in Persona 5, and one of the hardest in the series for sure. All the Personas I used are at the end of the video above as usual.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Will put any other Lavenza vids I do here:</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/nVxVUaLVPSw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/Vzy2Jc4YUPI\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p graf--empty\"> </p>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/7/maxresdefault-16.jpg",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 5 Royal"
            ],
            "date_published": "2025-01-08T08:45:37-07:00",
            "date_modified": "2025-04-18T01:22:38-06:00"
        },
        {
            "id": "https://bainz.ca/persona-5-royal-party-member-builds/",
            "url": "https://bainz.ca/persona-5-royal-party-member-builds/",
            "title": "Persona 5 Royal Party Member Builds",
            "summary": "One of the things Persona 5 Royal added compared to the original&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/65MrNGz4INU\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>One of the things Persona 5 Royal added compared to the original P5, is the degree to which you can customize your party member’s Personas. In Vanilla P5, you were basically stuck with the skills they learnt by level up, meaning some party members felt distinctly inferior to others by the endgame.</p>\n<p class=\"graf graf--p\">In P5R, you have access to the Jazz Club, which you can use to boost a party member’s stats or have them learn a new skill. A full list of Jazz Club skills can be found <a href=\"https://samurai-gamers.com/persona-5/jazz-jin-bar-guide/\" data-href=\"https://samurai-gamers.com/persona-5/jazz-jin-bar-guide/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">on this page</a>, but I’ll list the ones I feel most important: 9/4 Charge, 9/25 Concentrate, 12/4 Heat Riser, 12/11 Debilitate, 1/15 Ali Dance, 1/22 Arms Master and 1/29 Spell Master.</p>\n<p class=\"graf graf--p\">P5R also added Persona Traits, which act as unique abilities that can benefit the party in different ways. Given the new options available, I wanted to post the party builds I had at the end of my first playthrough and talk about each character a bit. At the end of this post, I also listed some of the best accessories to equip, as well as how to get the Ultimate Weapons for each character. For a full list of trait and skill descriptions, <a href=\"https://aqiu384.github.io/megaten-fusion-tool/p5r/skills\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/p5r/skills\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">check this page</a>.</p>\n<p class=\"graf graf--p\">For the accessory slot on the characters, I tried to put different options that suited their specific skill set, mainly relevant during the endgame. For most of the game, the best accessory to have on nearly every character is the SP Adhesive 3 (Takemi’s clinic at Rank 5, 50% discount at Rank 7). If you have the DLC, itemizing Izanagi-no-Okami gives an accessory that is the same as the SP Adhesive 3 and gives +3 All Stats. For Joker’s Personas and this same sorta post for P4G and P3R:</p>\n<ul>\n<li><a href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" data-href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-royal-builds-1ec9f2fee2b5\"><strong class=\"markup--strong markup--mixtapeEmbed-strong\">Ultimate Persona Team (Persona 5 Royal Builds)</strong></a></li>\n<li><a href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" data-href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\"><strong class=\"markup--strong markup--mixtapeEmbed-strong\">Persona 3 Reload Party Member Builds</strong></a></li>\n<li><a href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" data-href=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\" class=\"markup--anchor markup--mixtapeEmbed-anchor\" title=\"https://medium.com/@bainz350/persona-4-golden-party-member-builds-77b823572695\"><strong class=\"markup--strong markup--mixtapeEmbed-strong\">Persona 4 Golden Party Member Builds</strong></a></li>\n</ul>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Morgana</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*jrSaSdxaJFVo75G-JQFntA.png\" data-image-id=\"1*jrSaSdxaJFVo75G-JQFntA.png\" data-width=\"1440\" data-height=\"808\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Majestic Presence — Doubles effectiveness and decreases costs of Recovery skills for all allies</li>\n<li class=\"graf graf--li\">Accessory: Rosary of Purity — Holy Benevolence: Revive multiple fallen allies to max HP (Itemize Maria during an alarm)</li>\n</ul>\n<p class=\"graf graf--p\">Morgana’s trait, Proud Presence, doubles the effectiveness of party healing skills, making him the best healer until you get into the mid-to-late game. When Makoto eventually learns Marakukaja around the time of Palace 5/6, I tend to not use Morgana nearly as much. Though, Morgana is able to learn Marakukaja from the Jazz Club (on 7/17 and 10/16), so he doesn’t have to stay as frail as he was in Vanilla P5.</p>\n<p class=\"graf graf--p\">If you want Morgana to be the best healer he can be, the Rosary of Purity accessory you get from itemizing Maria lets you revive multiple allies. If you mainly use Morgana to heal the party in between battles via the menu, the Black Headband R increases max SP by 30%.</p>\n<h4 class=\"graf graf--h4\">Ryuji</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Lc_wec14R7DtEm_mmXBz_A.png\" data-image-id=\"1*Lc_wec14R7DtEm_mmXBz_A.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Eccentric Temper — Low chance to strengthen Phys attacks by 80% for all allies</li>\n<li class=\"graf graf--li\">Accessory: Bravery Sash (Arms Master, P4 Protagonist fight DLC)</li>\n</ul>\n<p class=\"graf graf--p\">Ryuji’s probably the character that needs the least amount of work to be good, he’s very much unchanged from Vanilla P5: he hits hard, is tanky and is solid pretty much from beginning to end. Ryuji gets Elec Boost from his weapon Imprisoned Mjolnir, so that’s why it’s not on here. Besides the Arms Master accessory, a good one to equip could be the Orichalcum R, providing +7 All Stats.</p>\n<h4 class=\"graf graf--h4\">Ann</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*iF1e7Jqf6dsZSm4wcGgw7g.png\" data-image-id=\"1*iF1e7Jqf6dsZSm4wcGgw7g.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Pinnacle of Magic — Low chance to halve attack spell costs for all allies</li>\n<li class=\"graf graf--li\">Accessory: SP Adhesive 3</li>\n</ul>\n<p class=\"graf graf--p\">Ann is very much similar to Ryuji, she is solid throughout most of the game, specializing in Magic instead of Physical skills. Although I didn’t keep her sleep skills of Dormina/Lullaby on the final build, I’d recommend keeping them on her for most of your playthrough, as Sleep allows for any type of attack to become a technical. Otherwise, I put Spell Master on her so she could use party-wide Concentrate as much as possible.</p>\n<h4 class=\"graf graf--h4\">Yusuke</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*OBvdyBc2ovAOPTwSv_jotg.png\" data-image-id=\"1*OBvdyBc2ovAOPTwSv_jotg.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Unparalleled Eyes — Greatly raises evasion rate against Phys attacks for all allies</li>\n<li class=\"graf graf--li\">Accessory: Black Moon R — Apt Pupil, Str +8 (Tsukiyomi, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\">Yusuke’s the character I most wanted to upgrade using the new skills from the Jazz Club. In Vanilla P5, it was often difficult to justify using Yusuke over Ryuji, because Ryuji got Matarukaja and Charge, meaning Yusuke’s damage output was considerably lower at the endgame. Another problem was, Yusuke is best as a Physical attacker, but his lower HP and Endurance stat made it so if he didn’t dodge an attack, you might have had to spend multiple turns reviving him.</p>\n<p class=\"graf graf--p\">Luckily in Royal, he can learn Charge, which mitigates his prior damage problems, and Arms Master, which makes the HP loss from his Phys skills much more manageable. And now, due to Ryuji’s trait having a chance to raise all ally Phys attacks, Yusuke and Ryuji no longer really compete with one another, but are best used on the same team.</p>\n<h4 class=\"graf graf--h4\">Makoto</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*yQ9Jy7on9BO1BArIaTbJ0Q.png\" data-image-id=\"1*yQ9Jy7on9BO1BArIaTbJ0Q.png\" data-width=\"1440\" data-height=\"809\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Gaia Blessing — Increases chance of inflicting Burn, Freeze, and Shock by 50% for all allies</li>\n<li class=\"graf graf--li\">Accessory: Magic Masangi (Spell Master, P3 Protagonist fight DLC)</li>\n<li class=\"graf graf--li\">Other Accessories: Salvation Crown (Tanaka’s Shady Commodities)</li>\n</ul>\n<p class=\"graf graf--p\">Makoto’s great because she can heal, play support and isn’t lacking in damage output. Once she learns Mediarama and Marakukaja, I tend to use her as the healer instead of Morgana. Her original trait Gaia Pact increases the chances of Burn/Freeze/Shock, so she synergizes with any combination of Ann/Yusuke/Ryuji, and can hit Nuke technicals off those statused enemies. Not to mention, her Ultimate gun gives her +11 all stats, making her overall endgame stats quite a bit higher than other party members. I had her learn Debilitate from the Jazz Club on 12/11.</p>\n<h4 class=\"graf graf--h4\">Haru</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*0qPuwE9Z3FKD87q9PDHzTg.png\" data-image-id=\"1*0qPuwE9Z3FKD87q9PDHzTg.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Cool Customer — Reduces ailment susceptibility by 50% for all allies</li>\n<li class=\"graf graf--li\">Accessory: Magic Masangi (Spell Master)</li>\n<li class=\"graf graf--li\">Other Accessories: Black Moon R (Apt Pupil)</li>\n</ul>\n<p class=\"graf graf--p\">Haru is definitely a tough character to build for. Given she learns so many skills, you probably have to decide between Gun or Psy for her at some point. In Vanilla P5, I went with the Gun skills, because of their good damage and high crit-rates. A gun Haru build is still good in P5R, but I think the Psy one might actually be better this time around. The reason for this being two things: the new Technical Damage ranks and the Chaînés Hook ability you get from the Faith Confidant Rank 4.</p>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*HfAGhlu3j5fWRKEbw4PKjg.png\" data-image-id=\"1*HfAGhlu3j5fWRKEbw4PKjg.png\" data-width=\"585\" data-height=\"254\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Firstly, by going to the Billiards club in Kichijoji, you can <a href=\"https://www.thegamer.com/persona-5-royal-technical-rank-billiards-guide/\" data-href=\"https://www.thegamer.com/persona-5-royal-technical-rank-billiards-guide/\" class=\"markup--anchor markup--p-anchor\" rel=\"noopener\" target=\"_blank\">increase your party’s Technical Damage rank</a>. As you raise your rank, you increase the damage boost and chance of knockdown when landing a tech, all the way up to Rank 4, where tech attacks have a guaranteed chance of knockdown. This is relevant for Haru, because Psy skills are what allow you to land technicals on almost all ailment types, including Sleep, Dizzy, Rage, Fear, Forget, Confuse, Despair and Brainwash. Given the benefits from Tech Rank 4, Haru can deal a fair bit of damage and get lots of knockdowns during a Palace run, if you are consistently applying ailments.</p>\n<p class=\"graf graf--p\">Secondly, the Chaînés Hook ability allows you to ambush enemies using your grappling hook. When these enemies are ambushed, there is a high chance of at least one enemy having the status ailment of Dizzy, Confuse or Fear. Given that you can use this all the time in Palaces instead of the normal ambush, it makes using Haru’s Psy skills even easier throughout the course of the game.</p>\n<p class=\"graf graf--p\">Otherwise, I gave her Concentrate to keep her damage output respectable during boss fights, and kept One-Shot Kill just to use it with the Apt Pupil accessory at times. Makarakarn/Tetrakarn are useful to keep on Haru, but can be replicated by items you buy from Takemi. Amrita Shower can come in clutch, but it’s not as relevant late-game because you likely have access to Salvation.</p>\n<p class=\"graf graf--p\">.</p>\n<p class=\"graf graf--p\">.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">.</p>\n<p class=\"graf graf--p\">.</p>\n<h4 class=\"graf graf--h4\">Akechi</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*N0CbtjsrzIq7oC77v7z3gg.png\" data-image-id=\"1*N0CbtjsrzIq7oC77v7z3gg.png\" data-width=\"1440\" data-height=\"808\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Ingenious Spirit — Chance to halve Support and Almighty skill costs for all allies</li>\n<li class=\"graf graf--li\">Accessory: St. Hermelin Badge (Null Bless/Curse)</li>\n</ul>\n<p class=\"graf graf--p\">Akechi gets high tier skills in Phys, Gun, Curse and Almighty, making him versatile at the cost of lacking damage output (due to no Boost/Amp skills). He gets one of the best support skills in Debilitate, which is very useful in boss fights. Debilitate is available earlier via the Jazz Club, but having it on Akechi is still nice.</p>\n<p class=\"graf graf--p\">Akechi’s trait Tactical Spirit has a chance to halve ally Support skill costs, and after some testing I did, the chance rate on it is about 60%. Due to his trait, you’re able to spam the Tier 3 skills like Fighting Spirit, High Energy, etc to a higher degree when he’s in your party. There aren’t a ton of opportunities where the reduced SP cost makes a big difference, but it’s a good bonus for just having him in the party.</p>\n<p class=\"graf graf--p\">One last thing to know is that the Final Boss uses Bless skills, so equipping the St. Hermelin Badge or Ring of Vanity (which removes weaknesses) would help a lot there. Attack Master can be replaced with his Tier 3 skill Rebellion Blade, as Attack Master is redundant if Joker uses an Auto-Mataru Persona.</p>\n<h4 class=\"graf graf--h4\">Kasumi</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*xVTu1sm5BxPTJfw9yLBT6w.png\" data-image-id=\"1*xVTu1sm5BxPTJfw9yLBT6w.png\" data-width=\"1438\" data-height=\"718\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Trait: Veil of Sunrise — High chance to prevent down when weakness struck for all allies</li>\n<li class=\"graf graf--li\">Accessory: Orichalcum R (Evade Phys, +7 All Stats)</li>\n</ul>\n<p class=\"graf graf--p\">The skills Kasumi learns are very focused and she works well because of that. She learns Sword Dance and Vorpal Blade, the highest crit-rate single target and multi-target Phys moves. Apt Pupil doubles the chance of landing a critical, while Ali Dance halves the foes accuracy, making up for her lower Endurance stat. Brave Step boosts the critical rate of the whole party, making her super useful in any situation where the enemy is susceptible to crits.</p>\n<p class=\"graf graf--p\">Kasumi isn’t super customizable considering when she joins the party in-game, but she functions just fine despite that. I gave her the Orichalcum R, to boost her stats higher as she doesn’t use that much SP. Her tier 3 skill Masquerade can replace Sword Dance.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Best accessories in general:</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">SP Adhesive 3 (Takemi’s clinic at Rank 5, 50% discount at Rank 7)</li>\n<li class=\"graf graf--li\">Shiny Belt R: Invigorate 3/All Stats +3 (Itemize Izanagi-no-Okami during an alarm, DLC)</li>\n<li class=\"graf graf--li\">Ring of Envy: Auto-Concentrate/Masukukaja (Palace 6 Will Seed accessory)</li>\n<li class=\"graf graf--li\">Ring of Greed: Attack Master/Concentrate (Palace 5 Will Seed accessory)</li>\n<li class=\"graf graf--li\">Ring of Pride: Defense Master/Charge (Palace 7 Will Seed accessory)</li>\n<li class=\"graf graf--li\">Pick-Me-Up Tie: Insta-Heal (1/15 Home Shopping Channel)</li>\n<li class=\"graf graf--li\">Divine Pillar: Firm Stance (Beat the Reaper)</li>\n<li class=\"graf graf--li\">Crystal Skull R: +6 All Stats &amp; Angelic Grace (Itemize Crystal Skull during an alarm)</li>\n<li class=\"graf graf--li\">Orichalcum R: +7 All Stats &amp; Evade Phys (Orichalcum, Alarm)</li>\n<li class=\"graf graf--li\">Bravery Sash: Arms Master (High score on P4 protagonist fight)</li>\n<li class=\"graf graf--li\">Magic Masangi: Spell Master (High score on P3 protagonist fight)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">For the best armor:</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Men: Tantric Oath R (Satan, Alarm)</li>\n<li class=\"graf graf--li\">Women: Sirius Armor EX (Messiah, Alarm) or Lovely Witches Robe (Wash the sooty armor you can get from Scathach during the final Palace)</li>\n<li class=\"graf graf--li\">Morgana: Dragon Scale Scarf (Clean sooty armor you get from Fafnir during the final Palace)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Character’s ultimate weapons (and their secondary effects):</strong></p>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Joker</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Punish Dagger (Airsoft Shop) or Paradise Lost R, Reduce Curse dmg (high), (Satanael, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Tyrant Pistol EX, +15 Magic (Lucifer, Alarm) or Nataraja EX, +6 All Stats (Metatron, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Morgana</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Claiomh Solais R, +50 SP (Mother Harlot, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Sudarshana EX, High dizzy (Vishnu, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Ryuji</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Imprisoned Mjolnir, +Elec attacks (Thor, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Megido Buster, High burn (Shiva, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Ann</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Dainaraka Whip, High freeze (Black Frost, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Gungnir, Medium despair (Odin, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Yusuke</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Usumidori R, High fear (Yoshitsune, Alarm) or Senryou Takusha R, +6 Strength (Ame-no-Uzume, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Providence, +13 Agility (Uriel, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Makoto</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Gordios, +Critical Rate up (high), (Cybele, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Judge End, All stats +11 (Michael, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Haru</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Fleurs du Mal R, Ma+6/High Dizzy (Beelzebub, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Yagrush EX, High shock (Baal, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Akechi</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Hinokagutsuchi II, High burn (Futsunushi, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Ancient Day, All stats +6 (Vohu Manah, Alarm)</li>\n</ul>\n<p class=\"graf graf--p\"><strong class=\"markup--strong markup--p-strong\">Kasumi</strong></p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\">Melee: Sword of Sinai II, High dizzy (Sandalphon, Alarm)</li>\n<li class=\"graf graf--li\">Ranged: Sahasrara EX, All stats +6 (Ardha, Alarm)</li>\n</ul>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/6/ksJmxHAF3c4PV9N7MRvLCeWb.png",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 5 Royal"
            ],
            "date_published": "2025-01-08T08:39:04-07:00",
            "date_modified": "2025-04-18T01:22:34-06:00"
        },
        {
            "id": "https://bainz.ca/ultimate-persona-team-persona-5-royal-builds/",
            "url": "https://bainz.ca/ultimate-persona-team-persona-5-royal-builds/",
            "title": "Ultimate Persona Team (Persona 5 Royal Builds)",
            "summary": "Back when I finished Vanilla Persona 5, I made a post about&hellip;",
            "content_html": "<section class=\"section section--body\">\n<div class=\"section-divider\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Back when I finished Vanilla Persona 5, I </span><a href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-builds-be2a57efa24e\" data-href=\"https://medium.com/@bainz350/ultimate-persona-team-persona-5-builds-be2a57efa24e\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\" rel=\"noopener\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">made a post</a><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> about my NG+ team. With recently being able to finish Persona 5 Royal, it felt natural to make another post of the Personas I used this time around, including some of the best &amp; strongest ones in the game.</span></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<p class=\"graf graf--p\">Related:</p>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" data-href=\"https://medium.com/@bainz350/persona-3-reload-party-member-builds-b3c9a22f6c44\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 3 Reload Party Member Builds (New!)</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" data-href=\"https://medium.com/@bainz350/persona-5-royal-party-member-builds-7505384717de\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 5 Royal Party Member Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" data-href=\"https://medium.com/@bainz350/persona-4-golden-builds-4e6873e91089\" class=\"markup--anchor markup--li-anchor\" target=\"_blank\" rel=\"noopener\">Persona 4 Golden Builds</a></li>\n<li class=\"graf graf--li\"><a href=\"https://aqiu384.github.io/megaten-fusion-tool/p5r/personas\" data-href=\"https://aqiu384.github.io/megaten-fusion-tool/p5r/personas\" class=\"markup--anchor markup--li-anchor\" rel=\"noopener\" target=\"_blank\">P5R Fusion Calculator</a> (with Skill/Trait Descriptions)</li>\n</ul>\n<p class=\"graf graf--p\">In Royal, there’s a relatively simple way to raise any Persona’s stats to 99. What you need are Ryuji’s Rank 7 ability Insta-Kill, Chihaya’s Rank 8 ability Celestial Reading and 20k Yen. Get Chihaya to raise the chances of a fusion alarm on a day you’re going to Mementos. Go into the first floor, and insta-kill 2–3 shadows to trigger an alarm. Go back to the Velvet Room, fuse any two Personas together, then use that new fused Persona (it’s name will be in yellow) to strengthen the one you want maxed stats on. The strengthening will not result in any XP gain, but you will get a total of +10 to random stats. You can keep doing this until all of a Persona’s stats are at 99.</p>\n<p class=\"graf graf--p\">Last thing: 3 of the Personas here are from the new DLC, but there’s plenty of great Personas in the base game/free legacy DLC, which are more than enough to complete any challenge the game throws at you (I cover some more at the end of this post). Optimizing Personas to this extent is mainly only useful for Super Bosses, otherwise you can basically use whoever you like and get through every Palace just fine. If you’re looking for good Personas during the early stages of the game, <a href=\"https://medium.com/@bainz350/best-early-game-personas-persona-5-royal-7ebb05c2f7a9\" data-href=\"https://medium.com/@bainz350/best-early-game-personas-persona-5-royal-7ebb05c2f7a9\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\" rel=\"noopener\">check out this post</a>.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Yoshitsune</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*11f7rk7zavMPzgO8j5EGsQ.png\" data-image-id=\"1*11f7rk7zavMPzgO8j5EGsQ.png\" data-width=\"1440\" data-height=\"808\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Yoshitsune is back, still as strong as ever. Hassou Tobi is a top 3 damaging skill in the game, alongside Myriad Truths and Shining Arrows, and now can even be boosted by traits. The best trait to have on Yoshitsune is Undying Fury, originally from Zaou-Gongen, which raises the damage of Phys skills by 30%.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/WUqPvRhI02U\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">The only essential skills that are a must to have on Yoshitsune are Hassou Tobi and Arms Master. Otherwise, you can go with adding a bunch of Drain skills, making it so you only take damage from Gun and Almighty. Or, you can go with more utility moves like Apt Pupil, Regenerate 3, etc.</p>\n<h4 class=\"graf graf--h4\">Satanael</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*Js2uPa8HwE8z3f56QJUs3g.png\" data-image-id=\"1*Js2uPa8HwE8z3f56QJUs3g.png\" data-width=\"1440\" data-height=\"809\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Almighty Build</figcaption>\n</figure>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*-RWCLBa3nWwrCNcbo8R_ag.png\" data-image-id=\"1*-RWCLBa3nWwrCNcbo8R_ag.png\" data-width=\"1439\" data-height=\"810\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Gun Build</figcaption>\n</figure>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*YvkVCEwd7L5pqcKT-jGx8g.png\" data-image-id=\"1*YvkVCEwd7L5pqcKT-jGx8g.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure>\n<figcaption class=\"imageCaption\">Elemental Build</figcaption>\n</figure>\n<p class=\"graf graf--p\">The main thing to know about Satanael is that his original trait, Pagan Allure, doesn’t exceed the damage cap (see at 1:40 in the Satanael video). So, if you are planning to use him for Magic and want max damage, Mighty Gaze, Intense Focus or Will of the Sword are better (all are +20% and exceed the cap). While Satanael’s original trait doesn’t exceed the damage cap, his exclusive skill Tyrant’s Mind (1.25x boost to all attacks) can. <a href=\"https://medium.com/@bainz350/persona-5-royal-traits-faq-582a66c5c475\" data-href=\"https://medium.com/@bainz350/persona-5-royal-traits-faq-582a66c5c475\" class=\"markup--anchor markup--p-anchor\" target=\"_blank\" rel=\"noopener\">Here’s a link to a Persona traits post if that was confusing.</a></p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/WVHAf8tRm0E\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">Given that info, there’s a number of different builds you could go for with Satanael. Excluding the new DLC, Satanael with Intense Focus or Will of the Sword and Black Viper provides the highest Almighty damage in the game.</p>\n<p class=\"graf graf--p\">Or you could go for a Gun build, because with Will of the Sword and Tyrant’s Mind, it provides the highest Gun damage possible. Another option is putting multiple elements on Satanael and adding Magic Ability. Pagan Allure, Magic Ability and Tyrant’s Mind would then give 2.34x damage (1.5*1.25*1.25).</p>\n<h4 class=\"graf graf--h4\">Arsene</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*yVNssJiMj47NXiaZ-vkZYg.png\" data-image-id=\"1*yVNssJiMj47NXiaZ-vkZYg.png\" data-width=\"1440\" data-height=\"811\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Have to keep the Starter around, and I wanted to replicate Arsene’s moveset from Persona Q2 and Persona 5 Scramble, being Curse and Gun-focused.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/FnQ-OaqMHdA\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">Here’s a video guide on building this type of Arsene. I also included a fusion path for an Almighty build with Megidolaon.</p>\n<h4 class=\"graf graf--h4\">Raoul</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*SM5aXpUtdaeB0Q2sCRXTwg.png\" data-image-id=\"1*SM5aXpUtdaeB0Q2sCRXTwg.png\" data-width=\"1439\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">At the start of the game, I knew I wanted to use Raoul for something, and I eventually landed on simply using him as more of a Support Persona. The Vitality of the Tree trait (originally from Attis) lets you use Thermopylae (full party Heat Riser) in normal conditions, while the other skill slots were filled with Charge, Concentrate, Debilitate and Raoul’s exclusive skill Phantom Show (high chance of Sleep to all foes). To get Vitality of the Tree on Raoul, re-fuse him by using Attis and Agathion. Orpheus’ Neo Cadenza (see below) is better than Thermopylae, but is only available through the paid DLC, while Vitality of the Tree+Thermopylae can be transferred to any Persona you want.</p>\n<h4 class=\"graf graf--h4\">Maria</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*ufAD9dB66zTlM12VWjxBWA.png\" data-image-id=\"1*ufAD9dB66zTlM12VWjxBWA.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Maria has two exclusive passives, one being Holy Whisper which restores 15% HP and 15 SP every turn, and the other being Holy Embrace which restores 25% HP every turn.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/SbsSsmlim-k\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">If you transfer the Demon’s Bite trait from Ongyo-Ki, which doubles own HP recovery, you can recover 80% HP per turn with Maria equipped. By adding the Regenerate 2 and 3 passives, it becomes 100% per turn. Instead of Regenerate 2 and 3, I opted to go with other passives like Ali Dance, Enduring Soul and Drain Fire, because 80% HP per turn is really more than enough.</p>\n<h4 class=\"graf graf--h4\">Izanagi-no-Okami</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*DFrkKNO9zgqt7CakpvIavA.png\" data-image-id=\"1*DFrkKNO9zgqt7CakpvIavA.png\" data-width=\"1440\" data-height=\"810\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">The strongest Persona available, for sure. Can one-shot the Reaper, one-shot most story bosses, even makes Super Bosses feel tame. Izanagi-nO has an exclusive trait called Country Maker, which increases Attack/Defense based on Inmate registry completion. With a full Persona compendium, Country Maker doubles your damage and halves damage taken.</p>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/y8iIns2mJmk\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<p class=\"graf graf--p\">Myriad Truths (3 times Heavy Almighty damage to all foes) is already a strong move, but it can be boosted by Almighty Boost, Almighty Amp and Magic Ability, giving you a 2x multiplier on it. Then boosted again by Country Maker, giving you 4x. Needless to say, nothing much stands up to it. Atlus seems to love making DLC overpowered, but they <em class=\"markup--em markup--p-em\">may</em> have gone a bit overboard here.</p>\n<h4 class=\"graf graf--h4\">Orpheus</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*vWKAgUIBO0HUcB9jjJFUzQ.png\" data-image-id=\"1*vWKAgUIBO0HUcB9jjJFUzQ.png\" data-width=\"800\" data-height=\"449\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"graf graf--p\">Orpheus’ exclusive skill Neo Cadenza heals 50% HP of the party, and also provides Heat Riser for the whole party, while only costing 24 SP.</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/5qFQuvocoac\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p class=\"graf graf--p\">If you pass down the Wealth of Lotus trait from Lakshmi, Neo Cadenza’s buffs will be extended by 2 turns. It also works with the 3 Auto skills, making them last 5 turns at the start of every battle. In the video to the left, I showed a fusion path for getting Wealth of Lotus on Orpheus, as well builds for Thanatos &amp; Messiah.</p>\n</div>\n</div>\n</section>\n<section class=\"section section--body\">\n<div class=\"section-divider\"><hr class=\"section-divider\"></div>\n<div class=\"section-content\">\n<div class=\"section-inner sectionLayout--insetColumn\">\n<h4 class=\"graf graf--h4\">Other great Personas:</h4>\n<figure class=\"graf graf--figure\"><figure class=\"graf-image\"><img loading=\"lazy\"  src=\"https://cdn-images-1.medium.com/max/800/1*xuSHWBxYCEx7FJjXID4bqw.png\" data-image-id=\"1*xuSHWBxYCEx7FJjXID4bqw.png\" data-width=\"700\" data-height=\"394\" data-is-external-image=\"true\"></figure></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Kaguya</strong>: Shining Arrows is a top 3 damaging skill in the game, making her the 2nd best Magic Persona, only exceeded by Izanagi-nO. But Kaguya comes free with the Legacy P5 DLC, so she’s a great option if you don’t want to get the new DLC. Kaguya also gets a trait called Inviolable Beauty, which triples the damage of all Counter/Repel skills.</li>\n</ul>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/bXiSjtiPiPo\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<figure class=\"graf graf--figure graf--iframe\"></figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Lucifer</strong>: Morning Star is a very strong move, and Lucifer went from having some of the worst resistances in Vanilla P5 to some of the best in P5R. A Megidolaon with Satanael will do more damage than Morning Star due to his unique skill Tyrant’s Mind, but Satanael is locked to NG+, and due to that Lucifer remains a great option.</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Magatsu-Izanagi</strong>: M-Izanagi’s trait Hollow Jester increases Attack by 40% per enemy inflicted with an ailment. Damage boosts in P5 are all multiplicative, so when 2 enemies have an ailment, your attack is 1.96x (1.4²). This can go all the way up to 5.37x when there are 5 enemies with a status ailment.</li>\n</ul>\n<figure class=\"graf graf--figure graf--iframe\">\n<div class=\"aspectRatioPlaceholder is-locked\">\n<div class=\"iframeContainer\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/yOLDXuO6Emg\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</div>\n</div>\n</figure>\n<ul class=\"postList\">\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Alice</strong> and <strong class=\"markup--strong markup--li-strong\">Daisoujou</strong>: Die for Me! and Samsara are the best insta-kill skills, and are exclusive to these two Personas, making them the best for that niche.</li>\n<li class=\"graf graf--li\"><strong class=\"markup--strong markup--li-strong\">Ariadne</strong>: One of the Personas from the legacy DLC, what you want her for is her exclusive trait Tag Team (Allows use of consumables without expending them after Baton Pass). If you Baton Pass to Joker when he has Ariadne equipped, you can use items without losing them. This means you can basically have unlimited Somas.</li>\n</ul>\n</div>\n</div>\n</section>",
            "image": "https://bainz.ca/media/posts/5/1_5ibjn6hJiEJtJJoweRHk1g.webp",
            "author": {
                "name": "bainz"
            },
            "tags": [
                   "Persona 5 Royal"
            ],
            "date_published": "2025-01-08T08:30:22-07:00",
            "date_modified": "2025-04-18T01:22:28-06:00"
        }
    ]
}
